{"pages":[{"title":"About","text":"Welcome to Mr.Yam , a platform dedicated to bridging the gap between the East and the West. As the founder of this website, I am passionate about sharing valuable insights, cultural experiences, and thought-provoking ideas from the East with the Western world. Here we believe that cultural exchange and understanding are vital for a harmonious global community. Through engaging articles, captivating stories, and immersive multimedia content, we aim to provide a unique perspective on various aspects of Eastern culture, including art, philosophy, cuisine, traditions, technology and more. Our goal is to foster a sense of curiosity and appreciation for the rich tapestry of Eastern heritage. Whether you are a seasoned traveler, a student of different cultures, or simply someone with a thirst for knowledge, Mr.Yam is here to enlighten and inspire you. Feel free to explore our website and immerse yourself in the vibrant world of the East. We encourage you to join the conversation, share your thoughts, and connect with like-minded individuals who share a passion for cultural exploration. If you have any questions, suggestions, or would like to collaborate, please don’t hesitate to reach out to me at:me@nickyam.com Together, let us embark on a journey of discovery, as : East tells West.","link":"/about/index.html"},{"title":"categories","text":"","link":"/categories/index.html"},{"title":"tags","text":"","link":"/tags/index.html"}],"posts":[{"title":"Apple Unveils the Most Powerful Device for Metaverse as Web3 Experts Transition to AI","text":"The first few months of 2023 marked a turning point for the metaverse. Just as web3 experts were transitioning to AI, Apple unveiled its groundbreaking device, the Vision Pro, for the metaverse. While renowned figures like Bill Gates had previously advocated for Microsoft to go all-in on the metaverse but then shifted their focus to AI, Mark Zuckerberg, who renamed his company Meta to align with the metaverse, admitted strategic missteps and announced layoffs for a transition. Influential voices and experts who were once avid supporters of Web3 and the metaverse quickly rebranded themselves as AI enthusiasts, proclaiming AI as the future to attract followers. These well-known figures, who seemed to chase every trend, became indicators of the industry’s direction and often ended up heading in the opposite direction. As they were abandoning web3 and the metaverse, Apple made a significant move during its product launch event. After learning about some firsthand experiences with the Vision Pro, it became evident that this was no ordinary announcement—it was a game-changer. If it took major tech companies, including Google, several months to develop somewhat satisfactory products to compete with ChatGPT, an AI capable of engaging conversations, Apple’s Vision Pro would likely leave internet giants and smartphone manufacturers trailing for at least a year or two. Without exaggeration, Apple’s Vision Pro has redefined the metaverse. While other companies blindly rushed into VR, and Zuckerberg’s VR devices demonstrated graphics reminiscent of 20-year-old animations, the enthusiasm surrounding the metaverse concept that peaked in 2021 was extinguished by these underwhelming products from manufacturers. Apple, known for its understated approach, took seven years to craft a revolutionary device that not only surpassed but also surpassed all expectations for the metaverse, similar to how the iPhone redefined smartphones under Steve Jobs’ leadership. Firstly, Apple embraced a unique strategic approach by prioritizing AR as the primary technology. When AR transitions into a closed, virtual environment, it becomes VR, but when it overlays the real world, it achieves augmented reality (AR) fusion. Imagine wearing the Vision Pro and immersing yourself in a cinematic experience. In reality, you are sitting on your couch at home, but in the virtual world, you are surrounded by picturesque landscapes. Mountains in the distance, water nearby. As you turn your head, you can see the virtual scenery around you. In front of you is a virtual screen displaying a movie menu (featuring eye-tracking technology!). When you find a movie you like, a slight pinch of your thumb and index finger initiates playback. These experiences only scratch the surface of VR. As you sit there, a virtual butterfly flies towards you. You extend your hand (in the real world), bringing it up to your face, and extend your index finger towards the butterfly hovering in front of you. The butterfly dances around before finally landing on your fingertip. A slight flick of your finger, and the butterfly flies away (this feature is part of Vision Pro’s boot-up demo). This is where AR comes into play. At this moment, the boundaries between the virtual and real world blur. Just like Zhuangzi’s dream of being a butterfly, it becomes unclear who has entered whose dream. Suddenly, your partner arrives home. They approach and sit on the other end of the couch, speaking to you (in the real world). You hear their voice and turn your head towards the sound. At that moment, the Vision Pro’s outer shell reveals your eyes to your partner (real-time AR rendering). Simultaneously, their image emerges within your virtual world, allowing you to see them. Vision Pro can render AR in two directions. One is from the inside out, presenting your eyes to the real world, and the other is from outside in, displaying your partner’s image in your virtual world. This enables natural conversation and interaction without the need to remove the device. Meanwhile, you can continue to focus on the virtual world, whether it’s the butterfly or the movie. The seamless integration of the real and virtual worlds is a perfect fusion. Moreover, imagine scanning your image to create a highly realistic digital avatar (VR) or rendering someone else’s digital avatar (such as a friend in a distant location or a deceased loved one) in front of you (VR). Imagine having a simulated portal on your living room wall, where one side represents your actual living room (reality), and the other side transports you to Jurassic Park (virtual). Dinosaurs could even cross the wall into your living room (AR). All of this becomes effortlessly achievable with Vision Pro. Sounds like something out of a science fiction novel, right? However, according to feedback from those who have experienced the device firsthand, all of the above capabilities have already been realized with Vision Pro. Looking ahead, one can envision a future where computers become unnecessary for work. Instead, all you need is a comfortable sofa, a desk, a cup of coffee, and Vision Pro, which can provide a large, expansive screen or multiple screens. One screen can display stock market charts, another can show a blockchain browser, a third can handle WeChat conversations, and the fourth can be dedicated to browsing the web or opening Uniswap. In the center, you can open Vim to write code or compose articles… all while feeling at ease! For nearsighted individuals like myself, Vision Pro allows for the insertion of prescription lenses, eliminating the need to struggle with fitting glasses frames inside the device. However, there may be specific requirements for the lens shape… Goodbye to computers, televisions, and movie theaters. As for smartphones, Vision Pro’s short battery life (only 2 hours) and its unconventional appearance when worn outdoors may still require smartphones as beneficial supplements for the time being. Priced at $3,499, the question remains: Is it exorbitantly expensive, delightfully appealing, or a combination of both?","link":"/Tech/Apple-Unveils-the-Most-Powerful-Device-for-Metaverse-as-Web3-Experts-Transition-to-AI.html"},{"title":"Bitcoin during the bear market","text":"Overnight, Bitcoin continues to consolidate above the 30k level. Looking at the weekly chart, the previous day’s court ruling regarding XRP, which obtained a 2/3 non-security designation, turned out to be a mere “show of empty positivity.” It further depleted the market’s strength and brought everything back to square one, continuing the trend of slight decline. Short-term speculators have been repeatedly washed out, while long-term hodlers are unable to sell. Market liquidity is drying up, yet there is a lack of substantial catalysts for a significant change, resulting in the current awkward situation. Regarding the harvesting of the US dollar in the global circulation, there are additional explanations in the internal reference material. Due to the Cantillon effect, every round of the circulation cycle brings pain to the world where liquidity is destroyed, while the United States emerges as the winner, gaining fresh dollars. The key issue is that all of this is man-made, not natural. In the cycle of US dollar circulation, what is the position of Bitcoin? Does it belong to the world or to the United States? How does it benefit or suffer at the beginning and end of the expansionary cycle, and at the beginning and end of the contractionary cycle? The Federal Reserve is the source of liquidity. The liquidity injected by the Federal Reserve flows into the United States through various channels and then spreads to the rest of the world. The United States can be seen as a small pond, while the world represents a larger reservoir. Of course, due to the United States’ position as the world’s largest economy, its pond holds a significant share compared to the rest of the world. How does the Federal Reserve create liquidity? Through the Treasury Department. The Treasury Department issues debt, and the Federal Reserve provides liquidity by injecting money into the system. This is the mechanism for issuing debt-based US dollars. At the beginning of an expansionary cycle, institutions that have access to US dollars go on a buying spree worldwide. Asset prices soar, surpassing the performance of the US stock market. The US stock market, however, faces pressure due to capital outflows. Towards the end of the expansionary cycle, global asset prices have become inflated, and the US stock market has experienced significant gains. Excessive liquidity floods the entire world. It’s a moment of celebration for asset prices, and everyone believes in an eternal bull market. At this point, the Federal Reserve begins to taper its liquidity injections, as it did towards the end of 2021. At the beginning of a tightening cycle, not everyone realizes the situation immediately, and the impact of interest rate hikes directly affects the global economy. No matter how strong the leverage appears, it can be broken by high interest rates. The world experiences a synchronized deleveraging process, leading to a sharp decline in asset prices. At the end of a tightening cycle, due to the siphoning effect created by the pump (Federal Reserve) on the global pool, the outflow from the world pool actually has a certain regenerative effect on US assets, such as the US stock market. The market exhibits a divergence, with the world experiencing a challenging environment while the US maintains its favorable position. Furthermore, we have seen in the events that unfolded at the beginning of 2023 that the entire system is subject to significant human intervention. When the Federal Reserve failed to control the outflow of water and encountered stubborn players in the global pool, the water drawn was insufficient to support the bleeding of the US capital market, resulting in the collapse of the US banking industry. In such a situation, what could be done? The intertwined nature of the Federal Reserve and the Treasury Department within this system became evident. Powell and Yellen swiftly took action, jointly expanding the balance sheet and providing targeted liquidity injections to the US banking system. Additionally, the Federal Reserve quickly introduced the “BTFP” tool, a nuclear-level instrument that provided full endorsement to the US banking system through central bank credit. Without delving into the causes and manipulations behind these facts, what we want to explore is which pool Bitcoin, as a new category of asset, will float in: the United States or the entire world? If Bitcoin floats in the US pool, it would exhibit a pattern of initial decline during the expansion phase, a surge at the end of the expansion, a sharp decline at the beginning of the contraction, and a rise at the end of the contraction. If Bitcoin floats in the global pool, it would follow a tide of rise, rise, fall, fall in accordance with the US dollar cycle (please note that the order we discuss here is expansion-contraction, which is reverse to the order discussed on Twitter, contraction-expansion). Currently, we are at the end of the contraction phase, with the world still experiencing the painful scarcity of liquidity, while the US stock market has already displayed a vibrant scene of prosperity. As for Bitcoin, it has long emerged from the swamp of $16k in December 2022, crossing the watershed of $30k. However, Bitcoin is not as favorable as the US stock market. Bitcoin is half in the US and half in the world. Perhaps this is why the CEO of BlackRock, Larry Fink, has been emphasizing that Bitcoin is international. It is neither American nor foreign—it is international. If the Bitcoin spot ETF, which provides access to the US financial capital market, is approved and listed, connecting the pipeline of Bitcoin with the flow of water from the US pool, it would undoubtedly subject Bitcoin to greater buoyancy from the US pool.","link":"/Crypto/Bitcoin_during_the_bear_market.html"},{"title":"BlackRock CEO Praises Bitcoin","text":"After a sudden surge to 31k, Bitcoin quickly retreated overnight, briefly dropping below 30k and currently maintaining consolidation near that level. This scene reminded Jiao Chain of our defensive counterattacks against Vietnam in the 1970s and 1980s. We would strike with full force and swiftly retreat, engaging in a decade-long border war to exhaust and defeat the enemy. This approach avoided getting deeply entrenched in a war quagmire while effectively undermining the enemy’s arrogance. By strategically retreating, occupying advantageous positions, and engaging in attritional warfare, we achieved our strategic objectives at minimal cost. Thinking along these lines, Jiao Chain also grew up during a time of war. However, back then, I was still young and knew very little about the bloodshed happening on the distant borderlands. Military affairs are an extension of politics, and political objectives often revolve around economic interests. The only difference lies in whose economic interests are at stake. Thus, the foundation of war is economic power, and the ultimate goal is also economic interests. However, this is not always the case. It’s not a matter of political immaturity but rather rooted in the nation’s culture and heritage. Sometimes, for certain sentiments, superiors take action without sufficient consideration of cost and benefit, which is a form of romanticism. On the other hand, extreme pragmatism prioritizes interests above all else, doing business with both friends and foes—a form of utilitarianism. In this regard, Russia leans toward romanticism, the United States leans toward pragmatism, and we stand somewhere in the middle. Previously, we analyzed that the key objective of the Federal Reserve in maintaining tightening measures was not inflation. Inflation is merely the target they publicly set, but the Federal Reserve has ulterior motives. Their crucial objective is to maintain the dominance of the U.S. dollar during economic recessions. They aim to be stronger than all other fiat currencies as well as all other assets, including U.S. stocks, Bitcoin, and most importantly, gold. The Federal Reserve’s vigilance toward gold has never wavered. When the minutes of the June meeting were released by the Federal Reserve, their recurring rhetoric sent shivers down people’s spines. What did they say? They claimed that the economy is still very strong, and therefore, they believe it is appropriate to continue raising interest rates. Some people may misunderstand and wonder why the Federal Reserve is acting so strangely, desperately trying to curb the pace of economic recovery in the United States. In reality, what the Federal Reserve desires is the economic downturn and even collapse of other countries and regions. With an unlimited supply of the strong U.S. dollar, they can enjoy the thrill of buying high-quality assets at bargain prices when other countries and regions plummet and experience margin calls and liquidations. Data shows that the market expects a probability of over 95% for the Federal Reserve to raise interest rates by 25 basis points at the end of July during the policy meeting. Considering the Federal Reserve’s consistent nature of not surprising the market, this outcome may not be unexpected. As pressure continues to mount like Mount Tai, it’s a race to see whose legs will break first. If legs keep breaking, it’s still possible to intervene. And it definitely won’t be the big brother making a move directly. If the big brother arranges for his archenemy to make a move, wouldn’t the big brother be completely uninvolved? While BlackRock submitted its application for a Bitcoin spot ETF, it also accomplished another major deal. BlackRock signed an agreement with Ukraine to take over almost all of its state-owned assets (including agriculture, industry, energy, infrastructure, etc.) and its debts, all for free. Ukraine, with broken legs, has sold itself completely in this situation. As Lu Xun once said, “Break your leg, then sell you a crutch and make you grateful.” At this point, Jiao Chain couldn’t help but think of a friend who, during the AI Grand Challenge earlier this year, jumped into the hype and invested tens of millions of hard-earned money. In just a few months, not only did he fill someone else’s pit with tens of millions but also accumulated millions in debt. Fortunately, he was eventually rescued by the big brother and didn’t sink deeper. However, he also paid a painful price, losing all his money and shares. Nevertheless, he managed to free himself from debt, so he couldn’t complain about losing millions but had to turn around and express gratitude for not being killed by others, right? Is it frustrating? Of course, it’s frustrating. You would feel frustrated too if you were in that situation. But does frustration help? No, it doesn’t. The participants in the game would say, “Who made you join in the first place? No one forced you; everything was voluntary and self-driven.” Some games are live games where you need to jump in yourself to participate. But some games are dead-end games where you sit at home, and the pot falls from the sky. Even if you don’t want to join, you have no choice. For Ukraine, this game is a dead-end game. Now, the reaper BlackRock has decided to jump into the Bitcoin game. Just five or six years ago, during the previous bull market cycle of Bitcoin, BlackRock’s CEO Larry Fink referred to it as a money laundering scheme. Now, BlackRock is also entering the scene and planning to launch its own Bitcoin spot ETF. The CEO of BlackRock, Larry Fink, has started praising Bitcoin, stating that cryptocurrency is the digital version of gold. He believes that Bitcoin does not rely on any other currency and is an international asset. The term “international” was romanticized by comrade Qu Qiubai and transliterated as “Yingte’na Xiongnaier,” forever immortalized in the song “The Internationale,” where the realization of Yingte’na Xiongnaier is a must. Comrade Larry Fink is embracing the Bitcoin that represents Yingte’na Xiongnaier. We welcome this development.","link":"/Crypto/BlackRock_CEO_Praises_Bitcoin.html"},{"title":"Blockchain Games in China","text":"In Year 2011, I first heard about BTC. At that moment, I thought BTC as something geek and would never be a true currency. As a curious person, I dug some coins by my SAMSUNG laptop and after a period of time just forgot BTC until I heard it again in Mid-2013 when the price rushed up to $1000 per coin. I thought BTC is a shell game then and never predicted that tons of Digital Coins would appear since then. Without doubt, Chinese Internet Giants won’t miss the bus while other fields are already full of competitors. The Passage is not aimed to talk about BTC or other digital coins, just introduce some interesting so-called blockchain apps made by Netease and Baidu. A lot of people who regret over and over again that they didn’t catch up the chance to be rich overnight by BTC, rush into the APPs to make money in the blockchain games. The games show that blockchains has value in being used outside of simple currency trading. A token is issued to the user and this token gives the user full ownership over the object. In Feb 5th, 2018, Baidu released Laici Dog which just pronounced as “Let’s go” in Chinese. After registration, the user can adopt a low grade dog for free. You can sell it for Laicicoins and buy another lovely dog who has been labelled such as epic\\myth\\excellence and identified a lucky number just as you operate in the stock market. You also can have your dogs breed. The game does not feature cash transactions. Netease has another game Zhaoai Cat, even released earlier than Laici Dog. Zhaocai Cat in Chinese cultural means that the cat will make fortunes come to you itself. Xiaomi has also released a game called Jiami rabbit, meaning “crypto rabbit”. As we all know, Netease is a respectful company in Hangzhou China, where another Giant Alibaba is also located. As a traditional Game Corp, Netease decided to focus on a blockchain called planet after Zhaocai Cat was shut down. The planet is a platform where you can obtain Force by logging in, reading news , enjoying music, shopping on the app. Then The Force will auto run by itself and dig out BlackDiamond(ab.BD) which is similar to BTC. The Planet organizes activities on a regular basis to exchange BD to offline gifts or online benefits, someone even get pork which is made by Netease itself. The APP is a combination of Netease services and I think it’s a success. Then Baidu soon Copied another APP called Du Yuzhou, meaning that Baidu Cosmos. Compared to the name planet, Baidu has greater ambitions than Netease. It calls the Netease force as Gravitation and the Netease BD as Element. However Baidu didn’t copy the way of playing, and introduced Q&amp;A competition about love\\sport\\culture, etc. Until now, I haven’t found out the function of Elements. The Games educates us about the blockchain. For me, I will play the Planet for a long time, but won’t have a long interest in The Baidu Cosmos. What about YOU? I hope more that the companies find more ways to use the tech for our life, not just the Games.","link":"/Crypto/Blockchain_Games_in_China.html"},{"title":"Contrasting Web3 Policies , Hong Kong's Virtual Asset Focus and Beijing's Internet 3.0 Emphasis","text":"Starting from June 1st, the guidelines for virtual asset trading platform operators and the anti-money laundering guidelines (referred to as the “Guidelines”) issued by the Hong Kong Securities and Futures Commission (SFC) have officially come into effect. The SFC has begun accepting applications for licenses from virtual asset trading platform operators and allows retail investors to use licensed virtual asset trading platforms. After much anticipation, the application date finally took effect on the first day of June. In the past month, Beijing also released the “Beijing Internet 3.0 Innovation and Development White Paper.” The white paper emphasizes that Internet 3.0 encompasses immersive sensory experiences and the integration of real and virtual economic activities, including the concepts of the metaverse and Web3. These concepts reflect the development trend of human society and the economy shifting from the real to the virtual, virtual empowering the real, and the integration of the real and virtual. So, what are the differences between Hong Kong’s Web3 policies and Beijing’s Internet 3.0? Different Nature:Hong Kong’s Web3 policies are supported and led by the Hong Kong SAR government, with involvement from multiple government departments and relevant individuals, including the Chief Executive of the Hong Kong SAR, Financial Secretary, Securities and Futures Commission, and the Legislative Council. On the other hand, Beijing’s “Beijing Internet 3.0 Innovation and Development White Paper” is released by the Beijing Municipal Science and Technology Commission and the Zhongguancun Science and Technology Park Management Committee. Its aim is to develop Beijing into an Internet innovation center through policy support and funding. The Beijing Municipal Science and Technology Commission is a consulting body for the Beijing Municipal Government, responsible for coordinating, organizing, and implementing the city’s scientific and technological policies. Different Focus:Hong Kong focuses on virtual assets, allowing investors to trade specific “large-market value tokens” such as Bitcoin and Ethereum on licensed exchanges with relevant safeguards. The Securities and Futures Commission of Hong Kong will also start issuing licenses to cryptocurrency exchanges. Beijing’s Internet 3.0 white paper focuses on artificial intelligence (AI) and the metaverse. Benefiting from the rapid development of technologies such as AI, blockchain, and graphics processing, the level of user experience and production efficiency in virtual digital characters, virtual live streaming, game production, and more are significantly improved. It is expected to become one of the first profitable application areas in the future. The white paper mentions that Internet 3.0 will give birth to new applications and new forms of industry in fields such as consumption, industry, governance, city management, healthcare, etc., promoting higher-level digital and intelligent economic and social forms for humanity. Different Visions:The Hong Kong SAR government is determined to compete as a global virtual asset hub. In the 2023-2024 Budget Speech released in February, it was mentioned that Hong Kong Cyberport has established a Web3 base, allocating HKD 50 million to accelerate the development of the Web3 ecosystem, including organizing international seminars, enabling industry and enterprises to stay at the forefront of development, promoting cross-sector business cooperation, and hosting more youth workshops. Developing Web3 and other financial technology innovation industries, embracing a broader digital space, makes Hong Kong an excellent choice. Beijing strives to build a global innovation center. The goal of the “Beijing Internet 3.0 Innovation and Development White Paper” is to allocate at least 100 million RMB (approximately 14 million USD) annually until 2025 to build Beijing into a global innovation center. This funding will be used to strengthen policy support, promote technological progress, and facilitate the development of the Web3 industry. The committee believes that the new allocation of funds will contribute to making Beijing a significant global innovation center in the field. Apart from the above, on May 31st, the Chinese Ministry of Industry and Information Technology officially released the national standard “Reference Architecture for Blockchain and Distributed Ledger Technology” (GB/T 42752-2023). This is China’s first approved national standard in the field of blockchain technology, further accelerating the standardization process of blockchain in China and laying the foundation for the high-quality development of the blockchain industry. On May 26th, Deputy Minister of Industry and Information Technology, Wang Jiangping, stated the government’s forward-looking layout for future industries such as artificial intelligence, Web3.0, advanced computing, and 6G. All these signs indicate that the government is increasingly focusing on the development of Web3 and blockchain. In summary, both Hong Kong and Beijing attach great importance to the Internet revolution brought about by blockchain technology. However, they have different emphases. Hong Kong aims to become a global virtual asset hub, focusing on the development and application of technology. On the other hand, Beijing aims to build a global innovation center, emphasizing the innovation of underlying technologies such as blockchain, AI, and big data in the industry. Whether in Hong Kong or Beijing, positive signals have been released to the market regarding the development of Web3 and blockchain.","link":"/Crypto/Contrasting_Web3_Policies_Hong_Kong_and_Beijing.html"},{"title":"Device shots – making shell screenshots online, supporting multi brand mobile phones, tablets, computers, TVs, monitors, smart watches","text":"Device shots is an online tool for making screenshots with shells. You just need to drag the screenshots onto the web page. It supports multi brand mobile phones, tablets, computers, TVs, monitors, smart watches and other devices. Screenshots with shells can make them look more specific, but in fact, they are mainly more beautiful. It’s easy to use with a lot of screenshots on the phone. The feature of device shots is that it supports many devices, including mobile phones, computers, tablets, smart watches, TVs and other devices. Including but not limited to the following equipments: Apple iPhone series Pixel series Samsung series IPad series Surface series MacBook series IMac series XPS series Apple watch series Sony SmartWatch 3 Apple Pro XDR display Dell ultrasharp display Samsung Frame Sony W850C It is easy to use the tool. First select the device type, then select the specific device, and then drag the screenshot in. Device shots are also built-in to accommodate many social platform sizes, such as Facebook, twitter, instagram, pinterest, dribble, snapchat, Google play, etc. Finally, adjust the background color and transparency. The link is below: https://deviceshots.com/?ref=nickyam","link":"/Tech/Device-shots.html"},{"title":"Do not apply double standards when it comes to carbon emissions","text":"Overnight, Bitcoin made a strong leap from the 26.5k level and rebounded to the 27.5k level. Recently, some people in the United States are applying double standards to Bitcoin’s carbon emissions. They claim that Bitcoin mining consumes a certain amount of electricity and results in a corresponding amount of carbon emissions, thus should be subject to a certain emission tax. However, they fail to apply the same standards to Tesla’s electric vehicles, which also consume a significant amount of electricity and generate a substantial amount of carbon emissions. Tesla, on the other hand, receives carbon emission credits from the US government every year and sells them to other companies in need, profiting from it. Both Bitcoin mining and Tesla’s electric vehicles consume electricity, yet Bitcoin is being taxed while Tesla is being rewarded. If the standard is based on the carbon emissions per kilowatt-hour of electricity consumed, then both should be taxed. If the standard is based on a reference value, such as carbon emissions from burning coal or oil, and the actual electricity consumption is from cleaner energy sources, then the same rewards should be given based on the emission reduction. This blatant double standard of punishment and reward is evident. This issue of carbon emissions and double standards is not new. In a 2010 interview by Chai Jing with Academician Ding Zhongli and Professor Qian Weihong from Peking University, Ding questioned the Western viewpoint of setting emission limits based on countries rather than population, asking, “Are Chinese people not human? Why should the same Chinese person emit less?” These two cases of double standards may seem different, but they are based on the same underlying logic: using value judgments as a fig leaf for double standards. In the case of Bitcoin and Tesla, the illogical argument is that Tesla’s new energy vehicles represent the future and have great value, while Bitcoin has no value. Therefore, Tesla’s electricity consumption should be rewarded, and Bitcoin’s electricity consumption should be punished. In the case of Chinese and American people, it’s the same flawed logic: how high is the value created by each American? Chinese people engage in labor-intensive work, so their value is considered low. Therefore, a Chinese person is deemed unworthy of enjoying the same carbon emission credits as an American. This logic has caused countless human tragedies throughout history. Eugenics is a product of this logic: able-bodied individuals are considered valuable for their labor, while those who are sick, elderly, or disabled and unable to work are deemed low in value. Thus, forced elimination is advocated for low-value individuals. Racial discrimination is also a product of this logic: white people are considered high in value, while black people are considered low in value. Therefore, white people should be masters, and black people should be slaves. Hitler’s fascism is likewise a product of this logic: the noble Aryan race is deemed high in value, while the inferior Jewish people are considered low in value. Thus, genocide is advocated against the latter. The philosophical basis of this logic is closely related to Jeremy Bentham’s utilitarianism. Utilitarianism aims to maximize overall value. However, is there really a unified standard for value? Can value be objectively judged? And is there truly such a thing as “overall value”? A classic criticism of utilitarianism poses a thought experiment: You, healthy and well, happen to pass by a hospital where five people lie, each with a damaged organ (liver, heart, spleen, lung, kidney) urgently needing replacement. The doctor says that sacrificing you would save the lives of these five people. Moreover, the work positions of these five people are more important and have higher value than yours, and sacrificing yourself would undoubtedly increase the overall value of society and make society better as a whole! Would you be willing? Value itself is inherently diverse. Something that one person treasures might be considered worthless by another person. What you perceive as having no value, I might consider as valuable as the sky. If you don’t like something, you simply don’t engage with it. But if you refuse to engage with it yourself and also prevent others from doing so, that is sliding towards fascism.","link":"/Crypto/Do_not_apply_double_standards_when_it_comes_to_carbon_emissions.html"},{"title":"Don't Do Cryptocurrency Investments Without 10 Million Dollars","text":"Overnight, Bitcoin slightly dipped below $30,000 but quickly rebounded, currently sliding along the $30,000 mark. A discussion about the entry barrier for cryptocurrency investment has sparked a debate in the overseas crypto community. It began when a newcomer asked a prominent figure how someone with just a few thousand dollars could start investing in crypto. Should they invest in Bitcoin, Ethereum, meme coins, or altcoins that outperform Bitcoin? Is it reliable? The prominent figure responded succinctly: “Go find a job.” Why? As mentioned in the previous “Earnings ability is the best alpha“ article. The conversation seemed to be on track until another KOL, a former partner at a crypto fund, made a statement that stirred the waters. He stated that you might need over $10 million USD to quit your job and independently start investing. Perhaps you could survive with less money, but your safety margin would decrease. It’s better to work while investing. The $10 million USD entry barrier indeed caused a sensation. Especially considering that a few years ago, there was a statistic claiming over 600 million Chinese people earned less than 1,000 RMB per month. For someone like me, who can’t even spare 1,000 RMB per month, talking about a $10 million USD entry seems out of reach. However, the individual clarified that this is the standard for full-time independent investment. For most newcomers, it’s best to focus on earning money through work. Turning 1,000 RMB into 2,000 RMB might require a 100% investment return, which is difficult for many newcomers to achieve. But increasing your off-work earnings is relatively easier. It’s like raising your monthly income from 1,000 RMB to 2,000 RMB, which is not as challenging. Thus, when your capital is limited, it’s not worth quitting your job to invest full-time in cryptocurrencies. Small capital means higher risk, and high leverage can lead to liquidation. Profits might not be significant, and it would consume a significant amount of energy, resulting in more losses than gains. The best strategy at this point is as follows: focus on improving your earning ability and skills outside of the crypto market. Many investors in the crypto community quit their jobs early to trade full-time. However, this might not be the best approach. But does one truly need over $10 million USD as an independent investor? The key lies in financial independence. According to the FIRE (Financial Independence, Retire Early) theory, as long as your assets exceed 4% of your living expenses, you can consider yourself financially independent and retire early. For example, if your total annual expenses are $200,000, you would need assets of $5 million to achieve FIRE. Even if you’re fully committed to crypto investment, it doesn’t mean you should engage in it non-stop. Often, the more you trade, the fewer profits you make, and you might accidentally fall into the harvesting range designed by predators. If you treat crypto investment as a professional endeavor, it may require a high entry barrier. However, if you view it as a wealth management tool, don’t dismiss it just because your initial capital is small. Wealth management often requires an early start and consistent efforts to accumulate results over time. We believe that the power of crypto lies in making finance more inclusive. Bitcoin’s vision is not about the mutual exploitation among a few wealthy individuals. The true strength comes from widespread adoption, allowing even the poor to participate and benefit from it, which is the true source of currency’s new power.","link":"/Crypto/Don't_Do_Cryptocurrency_Investments_Without_10_Million_Dollars.html"},{"title":"Earning Ability is the Best Alpha","text":"Overnight, Bitcoin remains above $30,000, maintaining its consolidation for the 25th day since June 23rd. What is the key to successful investment? Many have witnessed people abandoning beta (average returns) in pursuit of alpha (excess returns), selling Bitcoin for meme coins, only to end up not outperforming the market and suffering significant losses. While some courageous individuals may regroup and start again, others might become disheartened and exit the market. Whether Bitcoin serves as the beta for the cryptocurrency market depends on your worldview. If Bitcoin is considered the beta, then alpha would mean outperforming Bitcoin. If we take a certain index representing the cryptocurrency market (with or without Bitcoin) as the beta, the first question is whether this index can consistently outperform Bitcoin. If not, holding Bitcoin would naturally provide risk-free alpha. If it can, then we need to revisit why some investments fail to outpace Bitcoin. Many have tried numerous methods to achieve alpha over Bitcoin, such as buying altcoins, chasing memes, leveraging, trading contracts, and more. However, only a few have succeeded, and most end up with minimal gains or even losses. It becomes a zero-sum or negative-sum game, where success is not true investment success but rather survivorship bias. In my view, the ultimate winning alpha is the ability to consistently make money. If you excel at working, then your job income is your best alpha. If you have your own business, then the profits from it are your best alpha. If you are a landlord, the rental income is your best alpha. In short, the ability to generate income is the best alpha. Warren Buffett’s Berkshire Hathaway sticks to acquiring and controlling businesses with good fundamentals, allowing these subsidiaries to continuously generate profits. Through control, they become Buffett’s cash cows. Without control, Buffett might become a victim. Ownership makes a world of difference in the value game. Michael Saylor’s MicroStrategy (MSTR) creatively accumulates Bitcoin in various ways, amassing tens of thousands of coins. More importantly, MicroStrategy not only holds Bitcoin but also operates a software business that generates continuous cash flow, sustaining their Bitcoin accumulation without management fees. The “Eight Characters” investment strategy involves not just buying more, but a complete set of investment principles. “From Investment Novice to Financial Freedom” advocates holding Bitcoin while earning money and investing idle funds for the long term. Avoid getting trapped in a zero-sum game because if you cannot ensure you’re the reaper, you’ll likely become the crop. Furthermore, steer clear of negative-sum games, as all participants in such games end up as fish on the chopping board. When you buy a coin, you’re participating in a game designed by someone else. Before joining any game, make sure to understand its nature. If your limited knowledge prevents you from seeing through the essence of the game, it’s best to stay away. Most of the time, not losing is winning, and not losing means not decreasing your Bitcoin holdings. Trading your earning ability for steady growth in Bitcoin holdings is unassailable, ensuring a prosperous and enduring journey.","link":"/Crypto/Earning_Ability_is_the_Best_Alpha.html"},{"title":"The Concept of Universal Basic Income (UBI)","text":"With the rise of ChatGPT and OpenAI, another cryptocurrency-related project founded by Sam Altman called Worldcoin has also caught people’s attention. What does Worldcoin aim to do? It aims to use blockchain technology to implement Universal Basic Income (UBI), which means unconditionally giving free money to everyone, enough to cover their basic living expenses. This way, the problem of poverty can be solved in one fell swoop. People will no longer worry about their basic needs and can dedicate their time to more meaningful work. Distributing money is a challenging task. The best method humanity has practiced so far is distributing based on labor. As for distributing based on need, it remains an ideal concept only on paper. Let’s take the example of economic stimulus. China’s approach is to prioritize large infrastructure projects, employing workers who receive wages based on their work output. This is a distribution based on labor. In the United States, as we have witnessed during the past few years of the pandemic, the approach has been similar to what Bernanke did—helicopter money, providing unconditional cash subsidies to every legitimate citizen. However, this approach led to many people refusing to work, and it also contributed to inflation due to increased consumption. Regarding poverty alleviation methods, China’s approach in recent years has been focused on supporting industries or establishing factories in impoverished areas to provide employment opportunities. This enables local impoverished populations to have jobs, earn wages, and improve their income levels, ultimately achieving poverty alleviation. The United Nations has been providing aid to underdeveloped areas in Africa for many years, providing funds or donations directly to give money and food, but unfortunately, it has not been successful in helping several African countries escape poverty and become prosperous. Instead, it has benefited intermediaries such as various governments and agencies. This is the principle of “seeking truth from facts.” It is known that transcending the historical stages of human productivity and production relations is not an easy task. Therefore, it is better to work according to the current situation, starting from small steps and accumulating progress over time, even if we have lofty aspirations. I think this Sam Altman is not honest. Once ChatGPT became popular and OpenAI seized the opportunity, they quickly sought massive financing. When his reputation soared, Altman brought out a long-dormant project, raised $100 million in funding, and labeled it with idealism to move countless naive investors. I suspect it’s all to quickly launch the cryptocurrency and go public at a favorable price. Recently, this Altman even appeared at a hearing in the US Congress, where he reportedly received a warm reception. His statement, especially the remark “I have no ownership in OpenAI, I’m just pursuing my ideals,” seems to have deeply moved the members of Congress to tears. Insert clapping GIF from Leslie Cheung here. UBI is great. At the very least, it represents an exploration of the future. It is an improvement or revolution in distribution. If it’s an improvement, it will be implemented top-down, with the government distributing money per capita, which is the most efficient approach because the government possesses the most accurate population data. If it’s a revolution, it will be implemented bottom-up, with the masses spontaneously exploring various experiments to find the best methods, which can then be scaled and adopted universally. Worldcoin, driven by capital, doesn’t fit into either category. To prevent the Sybil attack, Worldcoin extensively collects iris data, which not only violates privacy but also raises doubts about its effectiveness. Where there are interests, people will take risks. They will purchase irises on a large scale in impoverished areas and then manipulate their identities. This is an inevitable outcome. In the end, it will become a game of fleecing naive investors, and World coin, as an intermediary in value transfer, will be able to profit from the money transferred from second-tier market “naive investors” to first-tier market “whales” as long as the transaction volume is high enough. As for where Worldcoin gets its money from, it’s certainly not solely from fleecing second-tier market investors. Its funding sources are worth pondering. Those so-called peace foundations, democratic foundations, and youth leadership foundations in the United States should probably be big customers of Mr. Altman, right? This is much more stimulating than Axie Infinity, where they fleece second-tier market investors to play that boring game of battling small creatures, and then distribute money to the people in the Philippines and South America. Therefore, it’s probably certain that Worldcoin will never enter the Chinese market.","link":"/Crypto/Free_Money_The_Concept_of_Universal_Basic_Income.html"},{"title":"Good Job, Tencent!","text":"Tencent released its quarterly report yesterday, revealing a year-on-year revenue growth of 10% and a profit increase of 27%. This has sparked various interpretations and discussions in public opinion. Let’s not delve into specific details here; those who wish to see positive views can find favorable articles, while those interested in negative perspectives can seek critical analyses. Everyone can find what they prefer. However, I’d like to highlight two main points for everyone’s attention. Firstly, Tencent is an internet company that relies heavily on its flagship products and traffic. The core of Tencent’s business model is as follows: products generate traffic, traffic generates revenue, and revenue leads to profit. Ultimately, assessing Tencent’s performance requires evaluating both the quality of its products and the performance of its traffic. WeChat and QQ are Tencent’s two major products, while other offerings such as Video Accounts, Mini Programs, and Red Packets and Payments are derivative or subsidiary products stemming from these two main platforms. When examining Tencent’s financial reports, it is crucial to consider the performance of its products and traffic records. Upon reviewing Tencent’s quarterly report, I found that apart from stating the significant growth in user engagement on WeChat, QQ, and Video Accounts, there weren’t many supporting data provided. Consequently, I can only say that they performed well, but I cannot offer further analysis. Secondly, Tencent’s business model, as mentioned earlier, is based on its foundational model of products and traffic generating revenue and profit. However, once Tencent has accumulated income and profit, it engages in new investments. It’s similar to a cycle where Tencent earns money, buys shares, receives dividends, and then reinvests. This process continues indefinitely. Therefore, when examining Tencent’s financial report, it is essential to pay attention to its investments alongside its products and traffic. Now, let’s talk about Tencent’s investments for the first quarter. The net cash flow from operating activities was ¥62.297 billion, while the net cash flow from investing activities was ¥65.199 billion. In comparison, the corresponding figures for the same period last year were only ¥33.822 billion and ¥20.105 billion, respectively. What does this set of data indicate? It shows that Tencent’s cash flow situation significantly improved in the first quarter of this year. They invested externally as much as they earned from their operations, and the net investment amount is more than three times that of the same period last year. In short, Tencent has ample funds and has restarted its investment activities. With solid products and traffic, along with resumed investments after the lifting of restrictions in the gaming sector, Tencent has unlocked all the shackles that had constrained them in recent years. This is the most remarkable aspect of Tencent’s quarterly report this year. Well, it’s absurd to always focus on whether expectations were met or claim there were failures. It’s important to address the topic accurately and avoid getting caught up in trivial matters. Let’s not lose sight of the bigger picture.","link":"/Tech/Good_Job_Tencent.html"},{"title":"Handbook of COVID-19 Prevention and Treatment","text":"Ma Yun Foundation invited many clinicians who participate in the treatment of new coronavirus and spent a week writing a Handbook of COVID-19 Prevention and Treatment for hospitals, doctors and nurses. Most of the hospitals in the world are facing challenges. We especially hope to share these practical experiences with hospitals and medical staff around the world ASAP. So please download, print, or forward them to your nearby hospitals and medical staff so that they can be ready. Thank you! Handbook of COVID-19 Prevention and Treatment: https://covid-19.alibabacloud.com/zh Handbook 中文版: https://www.alibabacloud.com/zh/universal-service/pdf_reader?pdf=Handbook_of_COVID_19_Prevention_zh_Moblie.pdf Handbook English version: https://www.alibabacloud.com/zh/universal-service/pdf_reader?pdf=Handbook_of_COVID_19_Prevention_en_Mobile.pdf","link":"/World/Handbook-of-COVID-19-Prevention%20and%20Treatment.html"},{"title":"Happy Death Day","text":"If you see Happy Death Day as a horror movie, you may be disappointed; but if you treat it as a chick film, this is definitely a wonderful piece that combines elements of horror, suspense, and hilarity, and will give you many surprises. A few months ago, the trailer for Happy Death Day was on fire on Chinese Weibo, and I was looking forward to it. Before I walked into the cinema, I was somewhat suspicious: the trailer seemed to have spoiled it. What else could I get for the entire movie?Fortunately, it turns out that Happy Death Day is not disappointing. There are no lack of funny words in the lines. The audience laughs and the rhythm is not sloppy. There are almost no deliberately stupid characters in the film.This is not easy for a movie with horror elements. Each supporting role is short-lived but full of personality. The most successful point of Happy Death Day is the creation of the hostess, with the IQ online from the beginning to the end, logic scoring full mark. As soon as discovering that she was caught in an infinite death cycle, Tree did not sit still and was fully motivated. She carried out various plans to try to find out the real murderer, and even chose to enter the next cycle in order to save the innocent. Even if the trailer has let the audience know what they might see, Happy Death Day tries to jump out in a relaxed and humorous way. While The woman is enthusiastic to help others, reconciling with the father, and apologising to the roommate, you will tell yourself this is certainly not the last cycle but still self-doubt by these plots. When the murderer finally revealed the face, and began to explain the ins and outs, Tree was very stunned and helpless: you were killing me over some stupid guy? Then the audience roared with laughter. There may be someone who criticize that the plot of Happy Death Day is too week, with all the problems of low-cost movies, but the outstanding beauty of Jessica Rothe makes up for all the shortcomings. For a long time no actress so attracts me on the big screen. It is highly recommended to watch if there is an opportunity. Open a packet of potato chips and unscrew a bottle of Coke. This 96 minutes is absolutely enjoyable. On the other hand, I have been thinking about that It is really hard to live a good life. I was touched by Seeing the woman blowing the candle telling that the birthday wish is “tomorrow”, seeing that today is the last day of your rest life from the encouraging to horror , and slowly realising the hope from today is the first day of your rest life.","link":"/World/Happy_Death_Day.html"},{"title":"How much BTC should you hoard?","text":"Often, friends struggle to determine the target amount when formulating a long-term investment plan. Some friends, with lower incomes, find it difficult to imagine owning 1 BTC, which is valued at around $30,000 or over 200,000 RMB. On the other hand, friends with more wealth feel that buying a few BTC doesn’t seem satisfying enough. In my opinion, it might be helpful to consider your current net worth relative to the global population of 8 billion people when estimating how much BTC you should hold. This approach allows you to maintain your wealth position without it diminishing. We owe this to Bitcoin, which provides a fairer measure of wealth. Its design, with a limited supply and inability for arbitrary inflation, ensures that the wealth stored in Bitcoin form doesn’t passively erode, thereby safeguarding your financial position. According to statistical data on the global distribution of personal wealth in 2021, only 62.5 million individuals (0.89% of the world population) possess a net worth of $1 million or more, forming the elite class at the top of the wealth pyramid. If we hypothetically divide the 21 million BTC equally among these 62.5 million individuals, each person would only have about 0.336 BTC. However, considering factors such as unreleased BTC, lost BTC, and uneven distribution, the amount held by the last individual in the elite class would be significantly smaller. Even if we consider the conservative estimate of 0.336 BTC, the total cost at the current price of $30.5k would be a little over $10,000 or around 70,000 RMB. This means that by spending less than 100,000 RMB today, you can achieve a wealth position equivalent to a net worth of one million US dollars, as measured by Bitcoin’s global wealth scale. If you believe that in your target timeframe, let’s say 20 or 30 years from now, Bitcoin can only measure a fraction of global wealth, you can introduce a percentage to calculate accordingly. For example, if Bitcoin were to grow to 10% of the global wealth in 20-30 years, the previously mentioned estimate of 0.336 BTC would need to be multiplied by ten, resulting in 3.36 BTC. At the current cost, this would be around $100,000 or 700,000 RMB. In other words, individuals with a wealth level equivalent to the middle-class today can potentially achieve upward mobility to the elite class by actively accumulating Bitcoin. Even if the investment amount of $100,000 still seems high, you can consider a lower level. The next wealth level after a net worth of one million US dollars is the middle-class with a wealth range of $100,000 to one million US dollars. There are approximately 627 million individuals worldwide (8.9% of the global population) in this category. If we add the two aforementioned classes together, it totals around 689.5 million people, dividing the 21 million BTC among them, resulting in no more than 0.03 BTC per person. At today’s cost, this would be around $915 or approximately 6,500 RMB, which is less than 10,000 RMB. Following the same calculation, with a 10% estimate for 20-30 years in the future, the target would be 0.3 BTC, costing less than $10,000 or 70,000 RMB. If you still find it challenging, we can lower the level further to the subsistence class with a net worth ranging from $10,000 to $100,000. There are approximately 1.791 billion individuals (25.6% of the global population) in this category. Adding up the three levels mentioned earlier, it totals 2.48 billion people, dividing the 21 million BTC among them. Each person would have no more than 0.0085 BTC, which is equivalent to a cost of $260 or less than 2,000 RMB today. By applying the same 10% calculation for 20-30 years, the target would be 0.085 BTC, requiring a cost of $2,600 or 20,000 RMB. If you have a monthly salary of 3,000 RMB and can save 1,000 RMB per month, that would amount to 12,000 RMB per year. In less than two years, you would be able to accumulate 20,000 RMB. The next bull market cycle is likely to occur within this timeframe, so this could be the final window of opportunity for accumulating BTC. For readers who already have a higher level of wealth, you can extrapolate upwards. However, statistical data doesn’t provide specific information on the number of individuals beyond the million-dollar net worth level. You may need to conduct further research using search engines. According to estimates by Credit Suisse, in 2021, there were approximately 218,200 individuals with a personal wealth of $50 million or more, known as ultra-high-net-worth (UHNW) individuals. With 21 million BTC divided among them, each person would have no more than 96 BTC. At the current cost, this would be less than $30 million or around 200 million RMB. Interestingly, for someone with a net worth of only $50 million, asking them to invest $30 million to buy around 1,000 BTC would be quite challenging. This presents a greater difficulty compared to the calculations we made earlier, where a person with a net worth of $1 million spends $10,000 or someone with $100,000 spends $1,000. The challenge arises because $30 million is 60% of $50 million, while $10,000 is only 10% of $100,000, and $1,000 is only 10% of $10,000. This means that for someone who is currently at the top of the wealth pyramid, the difficulty of maintaining their wealth position through accumulating Bitcoin is much higher than for an average or relatively less affluent individual. Conversely, based on the current wealth distribution figures, it can be inferred that merely through accumulating Bitcoin, individuals from the relatively poorer lower levels can move upward, while those from the relatively wealthier upper levels can move downward, resulting in a more equitable global wealth distribution. Moreover, the faster and better Bitcoin develops and the higher its proportion of global wealth becomes, the more pronounced the effect of wealth redistribution will be. In the previous calculations, we used a 10% estimate for Bitcoin’s proportion in 20-30 years. But what if this proportion increases to 20% or 50%? The lower someone’s current wealth level is, the lower the cost and the greater the benefits they can gain by participating in this intergenerational global wealth redistribution historical event. The earlier one participates, the lower the cost and the greater the benefits. The longer one accumulates, the lower the cost and the greater the benefits. Furthermore, the wealth redistribution brought about by Bitcoin benefits the greatest number of people, thereby inevitably mobilizing and uniting the largest number of people worldwide. This establishes the largest and most profound consensus, which in turn further promotes and ensures the continuous increase of Bitcoin’s proportion relative to the global wealth total. The more people participate, the more successful Bitcoin becomes. The more successful Bitcoin becomes, the more people benefit. The more people benefit, the more people participate. This is a positive feedback loop.","link":"/Crypto/How-much-BTC-should-you-hoard.html"},{"title":"How to care for children during the epidemic ?","text":"how to protect your children when going out Don’t go out if possible, that is the best way to protect your children. If have to, drive private car or take a taxi, and use public transportation less frequently such as buses and subways where people are crowed. Walking is the best way for nearby destinations. Both parents and children should wear masks and ensure timely replacement, and do not touch the outside surface of masks, so as to avoid the virus transferring to the hands. Carry instant sanitizer and other disinfectant products with you, disinfect your children’s hands in time if they touch other things, and try to keep children from sucking their fingers, rubbing their eyes and noses before disinfection. Wash your hands in the right way once you get home, change your and your children’s outerwear in case of virus spread during contact. Children’s food during the epidemic Make sure the food is thoroughly cooked, especially meat and eggs. Raw and cooked food should be handled by using two different cutting boards and different sets of kitchen tools and put in separate bowls; Wash hands when you switch between handling raw and cooked food; After your hands before touching your children. In addition, since COVID-19 can be transmitted through saliva, it is imperative to keep your child from eating food that has been tasted by others and not to cool your children’s food by blowing. These actions could spread the virus to children without notice. It is advised to use separate dishes and serving utensils, which can help to avoid cross-contamination. So, can you feed your children with chicken, duck and fish? Yes, but make sure it is cooked. Until now, there is no evidence showing that COVID-19 can be transmitted via regular meat and seafood. But be aware that both meat and eggs must be fully cooked before eating. Meanwhile be careful not to buy poultry or seafood from unknown source. Don’t touch live birds without protect.","link":"/World/How-to-care-for-children-during-the-epidemic.html"},{"title":"How to prevent the spread of COVID-19 when staying home","text":"Will open windows increase the chance of infection? Actually, good vatilation helps to reduce the amount of viruses that may exist in doors and helps to renew the indoor air. ‘Diluted’ outdoor air is almost impossible to bring viruses indoors. If your family members are suspected acute respiratory infection patients, open the window but keep the door closed during ventilation. Do not use central ventilation system to avoid the air in the sick people’s room entering the clean areas. Under what conditions home is isolation is necessary? For the moment, there are 3 types of people who need home isolation. Suspected COVID-19 patients with mild symptoms People who are diagnosed by doctors as suspected COVID-19 with mild symptoms and recommended clearly to have home observation. Close contact ( Close contacts are those who have been in close contact with a person known to have COVID-19 or a highly suspected case. ) A close contact is any of the following conditions and may need home isolation. Please see a doctor or contact local health department ASAP if you are: Living, studying or working with confirmed patients or having any other forms of close contact; Having treated, nursed or visited confirmed patients without effective protective measures; Having been in hospitalized in the same room with confirmed patients. Having been using the same means of transportation and had close contact with the confirmed patients. People who are considered necessary to be isolated by the local health department. If you have a fever ( body temperature above 100.5 F ) with any of the following conditions, please go to the hospital ASAP; Shortness of breath, obvious chest tightness and asthma; Have been in close contact with confirmed COVID-19 pneumonia patients; Patients with pre-existing heart, brain, liver, and kidney disease such as high blood pressure, heart problems, etc..","link":"/World/How-to-prevent-the-spread-of-COVID-19-when-staying-home.html"},{"title":"Liu Cixin on ChatGPT - Human Ineptitude as Humanity's Final Barrier","text":"In his speech titled “Sustainable Futures in Science Fiction Literature” at the United Nations Chinese Language Day, Liu Cixin offered a unique perspective on the future of humanity through the lens of science fiction. What does it mean to have a science fiction perspective? It means looking back at this tiny planet, which is smaller than a speck of dust but holds everything related to us, from a space 6 billion kilometers away from Earth. At the end of his speech, Liu Cixin discussed the potential impact of artificial intelligence, represented by ChatGPT, on people. In 2015, Liu Cixin once quoted Stephen Hawking’s viewpoint during an interview. Hawking had predicted that “artificial intelligence could surpass the dangers posed by nuclear weapons, and humanity would soon be controlled by AI.” At that time, Liu Cixin considered this statement somewhat alarmist. However, now he believes that it is time for us to be cautious about the future. 1. Artificial intelligence is expected to first replace high-skilled professions, which is contrary to our predictions. 2. Artificial intelligence has the potential to self-iterate and develop even higher levels of intelligence, but our computational power limits its progress. 3. Artificial intelligence may potentially lead humanity into a comfortable trap or complacency. Q：With the emergence of ChatGPT, it has sparked intense discussions among people. In your opinion, what kind of impact will the development of artificial intelligence have on the fate of humanity? Is there a possibility that self-iterating artificial intelligence could replace or even eradicate humans? I believe this (the impact of artificial intelligence) should be approached from two perspectives: the present or near future, and the distant future. From our near future or even our present perspective, we have already witnessed the impact of artificial intelligence on our social world. It has already shown a clear trend: the potential to replace humans in many jobs. This trend can be seen as a positive one as it has the potential to improve our quality of life, enhance human well-being, and make our lives more comfortable with the support of technology. However, on the other hand, we cannot ignore the impact of the development of artificial intelligence on human society. First and foremost, the most obvious point is that artificial intelligence may replace a significant number of “human jobs,” which goes against our previous predictions. Translation: Previously, our predictions suggested that artificial intelligence would primarily replace jobs that involve simple or repetitive tasks. However, it appears to be the opposite now. Artificial intelligence may first replace jobs that require high intelligence and advanced levels of education, such as doctors, teachers, stockbrokers, and so on. This includes the possibility of writers being replaced as well. Therefore, the impact of artificial intelligence on the development of the entire human world is profound. If we look at a higher level, artificial intelligence may have significant effects on many fundamental aspects of our world. It can greatly influence cultural arts, literature, human creativity, and our understanding of the world, potentially leading to a redefinition of these aspects. As artificial intelligence is already entering our scientific research, our understanding of the laws governing the world, the laws governing nature, and the laws governing human development, its potential impact is far-reaching. When artificial intelligence defeated many outstanding Go players in the field of Go, a remark from one of our most exceptional Go players left a deep impression on me. He said that Go in China is profound, with a history of two to three thousand years, accumulating profound theories and experiences. Even Go itself has become a cultural pursuit, infused with deep Zen-like meaning. Yet, in just one night, we discovered that everything we knew about it was wrong. This statement is indeed shocking, and we don’t know if such a thing will happen in other fields. If it does happen on a widespread scale, we cannot ignore the profound impact of artificial intelligence on the deepest layers of human culture and civilization. Now, I’ll address your second question regarding whether artificial intelligence has the potential to eliminate humanity. This question should be answered in two levels. The first level is the literal interpretation of “eliminating” humanity, where artificial intelligence uses some form of violence to completely eradicate humans or dominate the world. Based on the current trend of technological development, especially considering the current level of technology, the likelihood of this happening in the foreseeable future is not significant. However, as you mentioned earlier, there is an intriguing concept of iteration. The self-iteration of artificial intelligence is the behavior that poses the most potential danger at present. This behavior you mentioned is the self-iteration of artificial intelligence. It means that when artificial intelligence, with slightly higher intelligence than humans, starts creating new artificial intelligence just like humans do, the newly created AI may possess slightly higher intelligence than its creator. This process continues iteratively, rapidly advancing the intelligence level of these artificial intelligences. It is speculated that through this iterative process, their intelligence could surpass human intelligence by hundreds or even thousands of times. Since the computational speed of AI systems is thousands or even millions of times faster than the human brain, the iteration time can be incredibly short, estimated to be as little as half an hour to one hour. To put it in perspective, it took us a century to develop AI to its current level, but AI with intelligence hundreds of times greater might only take half an hour to an hour, which is a terrifying thought. However, the prediction overlooks one crucial factor: our human computational power. The computing capacity we can provide is limited. As the self-iteration of AI reaches a certain point, our computational power cannot support its advancement. This irony becomes an ultimate barrier. So, the notion of complete annihilation you mentioned is highly unlikely. The second form of “elimination” refers to a manner that we cannot conceive of yet. It means that this form of elimination aligns with our own intentions, unlike the first form that goes against human will. For example, with the development of artificial intelligence, as I mentioned earlier, it may replace a significant number of jobs. If our society adapts to coexist with AI and develops a new system for resource allocation, we could create a highly comfortable social environment and lifestyle. Most people may not need to work, as AI would handle the majority of tasks. In this scenario, we would increasingly surrender our control over societal operations to artificial intelligence. While life becomes increasingly comfortable, we may face an unprecedented trap in human history. Where would the vitality of human civilization lie? What would happen to our pioneering spirit? If this trajectory continues, we might face the fate of being eliminated by artificial intelligence, as you mentioned earlier. However, this process would be entirely within our own intentions, and artificial intelligence would not harbor any malice. It would simply follow human instructions. In such a scenario, if it were to occur, the level of intelligence and computational power required by artificial intelligence would be far less than the literal form of annihilation discussed earlier. Hence, it is indeed something we should be aware of and vigilant about for the future.","link":"/Tech/Liu%20Cixin_on_ChatGPT_Human_Ineptitude_as_Humanity's_Final_Barrier.html"},{"title":"Musk has arrived","text":"Musk has arrived. Not only has he arrived, but he has arrived with great fanfare. And it’s not just the arrival that’s making headlines; he’s also being received with high-profile receptions. Which Musk are we talking about? The one who produces Tesla cars, launches Starlink satellites into orbit, vows to send people to Mars with rockets, acquires Twitter and lays off 70% of its staff, and makes extravagant statements about Dogecoin while later calling it a scam on television. For Musk, who is more than an industrial capitalist but not quite a financial capitalist, this land is like a second home. Industrial capitalists and financial capitalists have a love-hate relationship. The former needs the latter’s financial support to grow and prosper, but when it comes to sharing and seizing surplus value, they become bitter rivals, envious of each other’s gains. That’s why Musk is dissatisfied with Wall Street and disdainful of Buffett. Musk doesn’t care about Buffett, and Buffett doesn’t care about Musk. During the darkest period when Musk had nothing but dreams and financial capital was unwilling to foot the bill for his dreams, he found himself on the brink of bankruptcy. He spent sleepless nights, shedding tears, and even now, looking back, he still feels a lingering fear. Those darkest years, which almost doomed him, made him realize the nature of financial capital: a strong gambling instinct. Financial capitalists look down on small, highly certain profits but are willing to take on all risks for future returns that could be thousands of times greater. He understood. To sell electric cars, he needed to tell a fantastic story about fully autonomous driving. To launch rockets, he had to package it as a grand dream of colonizing Mars. This strategy worked like a charm, attracting risk capital in droves. They fell at his feet, ready to serve Musk, and he never ran out of money again. But those old-school American financial capitalists still didn’t take him seriously. They even tried to keep him out of the game. They accused him of market manipulation and wielded the weapon of scrutiny. So Musk turned to cryptocurrency. In 2021, he directed Tesla to buy and sell Bitcoin, and he personally took center stage, promoting Dogecoin in various ways. He became the beloved Dogefather worshipped by global investors. And after acquiring Twitter, he even changed its logo to a dog’s head symbolizing Dogecoin. How can such a rebellious young man be compared to old money like Buffett? In this era of a precarious US dollar hegemony, cryptocurrency becomes a ladder for industrial capitalists like Musk to ascend to the ranks of new financial capitalists. They then enter the realm and overturn the tables of the old money, reshaping the rules of the game with a powerful weapon.","link":"/Tech/Musk-has-arrived.html"},{"title":"< On-Chain Voting > A Documentation of Social Contracts","text":"The discussion in this article is not about using blockchain as a voting technology to fulfill certain voting requirements in the external world, such as conducting elections for a state governor in the United States on the blockchain or creating prediction markets where people can vote on whether the US will default on its debt or reach an agreement at the last moment to avoid default. These examples merely utilize blockchain to facilitate voting on external matters. The focus of this article is on the issue of decentralized organizations conducting on-chain voting themselves, which may involve a blockchain-based DAO voting on governance proposals or even governing the blockchain itself. The key distinction here is reflexivity. In the latter scenario, voting as a means of collective governance has a feedback effect on itself. Initially, in the Bitcoin whitepaper, Satoshi Nakamoto discussed the concept of Proof of Work, stating that the essence of Proof of Work is “one CPU, one vote.” Here, “CPU” should be understood as a unit of computational power, meaning that the more computational power one possesses, the greater their voting power. This represents a form of implicit voting or an automated process. The purpose of voting is to make decisions regarding the system itself, particularly on matters crucial to the system’s consensus, which is fundamental for its survival and avoidance of collapse. It is a form of reflexive voting or, in other words, autonomous voting. This brings up the issue of “governance attacks.” In the case of Bitcoin’s longest chain decision, if malicious computational power exceeds a certain proportion, meaning they have a significant voting power, there is a chance of reversing the majority consensus. The difference here lies in the concept of a “governance attack.” In the context of Bitcoin’s longest chain decision, if malicious computational power controls just over 10% of the total computational power (voting power), there is a close to 0.1% chance of reversing consensus within six confirmed blocks. With the commonly accepted requirement of three confirmed blocks, there is a 5% chance of reversal. If malicious power controls over 30% of the voting power, even with six confirmed blocks, there is a significant 17.7% chance of reversal. Reversing the proof-of-work longest chain can be seen as a successful governance attack, enabling the occurrence of “double spending.” Therefore, successful on-chain voting requires a majority consensus. However, more importantly, it is essential to prevent interest groups capable of coordinating off-chain actions from controlling enough computational power to overturn the majority consensus. Is off-chain coordination always considered a governance attack? If a severe bug were to occur in Bitcoin, necessitating the coordination and unified upgrade of all miners to resolve it, would this coordinated action constitute an attack on Bitcoin? Technically speaking, it does. Any form of coordination can be technically defined as a governance attack because it violates the rule of the longest chain. However, if this “attack” reflects a strong off-chain consensus within the entire community or society, it becomes moral and permissible. This aligns with a famous quote in the field of law: “Law serves as the basis for condemnation, while ethics serves as the basis for exoneration.” If an act that violates the law is allowed by the prevailing moral standards of society, it cannot be considered a crime. When discussing the issue of shared governance in future organizations, we can draw insightful reflections from the exploration of Bitcoin. While voting in an organization does not necessarily need to be conducted on-chain, voting in a decentralized organization like a DAO does require utilizing a blockchain. This is because individuals’ identities, assets, and particularly the organization’s capital exist on the blockchain. Through on-chain governance, the aforementioned entities can be automatically executed. Therefore, the governance voting of a DAO exhibits reflexivity. For example, if a DAO votes to divide and distribute its own capital, akin to what the character Pigsy often says in “Journey to the West” about everyone taking their share and going their separate ways, then the DAO would effectively destroy itself. Thus, on-chain data is simply a “physicalization” of real-life existence and human nature in the off-chain world. The essence of on-chain voting is not merely about programs, logic, and rules, but rather the on-chain mapping and evidence of a social contract formed by a living community of individuals.","link":"/Crypto/On-Chain_Voting_A_Documentation_of_Social_Contracts.html"},{"title":"On the Self-Limitation of Ethereum","text":"Recently, the similarities and differences between Bitcoin and Ethereum regarding the issue of price self-limitation have also been discussed. Some further thoughts and analysis are recorded below for readers’ discussion and criticism. The issue of self-limitation is actually somewhat subtle. Ethereum also draws on Bitcoin’s method of dynamically adjusting transaction fees (miner fees) in its calculations. For Bitcoin, the miner fee = vBytes (transaction size in bytes) * fee/vBytes (fee rate denominated in BTC); for Ethereum, the gas fee = gas (amount of computational resources consumed by instructions) * gas price (denominated in ETH). Therefore, on the surface, there doesn’t seem to be a problem with whether the fee rate or gas price is denominated in BTC, ETH, or USD. From the perspective of supply and demand economics, if the pricing currency relative to fiat currency is such that the expected fee income for miners (converted to fiat currency value) is just their cost (denominated in fiat currency) plus a reasonable profit, they can lower the fee rate (fee/vBytes or gas price) to maintain stability of the product of vBytes * fee/vBytes or gas * gas price relative to fiat currency. The problem here lies in the intrinsic differences in the sources of value between the two systems. Bitcoin, as a value transmission system, derives its overall value (manifested as market capitalization multiplied by a certain amplification factor) from the total value it can securely transmit. The “security” here depends on computational power, and the total value that can be transmitted = sum(vBytes) * BTC price. Therefore, as the price of Bitcoin increases, assuming a constant byte throughput, the total value that the system can transmit will be higher (with a higher multiple relative to the price), resulting in a higher value for this value transmission system. Ethereum, on the other hand, is different. Ethereum is a runtime platform for an application ecosystem. Its overall value comes from the prosperity of the aforementioned application ecosystem, directly reflected in the activity level of applications used (number of transactions, N). Assuming there are no security issues, meaning that computational power is not important here and PoS and PoW are equivalent, and can maintain the same level of security needs, the total gas fee = N * (average gas * gas price) = (N * average gas) * gas price. With a constant overall processing capacity of the system, (N * average gas) remains constant, and average gas is a constant value, so N remains constant. If the goal is to further increase the value of the system (thus increasing the price of ETH), it would require increasing N to a level beyond the system’s total processing capacity, denoted as N’ (N’ &gt; N). However, the actual processing capacity of the system remains at N, and the result of the free market bidding is an increase in gas price to maintain N, thereby increasing the total gas fee (i.e., the system’s total revenue). The increase in gas price restricts the usage of low-paying participants, limiting the overall activity level of the ecosystem and consequently limiting the overall value of the system. Even more “sinister” (“clever”) is that after Ethereum EIP-1559, the direct channel of total gas fee revenue to miners has been cut off, and it is all “burned,” while the system issues a predetermined amount of new ETH to miners. When the burning exceeds the issuance, entering the so-called “deflation” phase, it means that the system’s revenue is large A, but only a small a is given to miners. A &gt; a, resulting in a surplus value delta = A - a. Furthermore, according to free market competition, the equilibrium income of miners is actually just their cost plus a reasonable profit. When miners transition from PoW to PoS, costs will decrease significantly, allowing a to decrease substantially. However, A is determined by market competition on the consumption side and will not decrease. Therefore, the surplus value delta reaches its maximum. This resembles the maximization of surplus value by lowering worker wages in capitalist production. However, a problem with capitalist production is that as competition and product improvement continue, monopolistic positions are broken, and the overall industry profitability perpetually declines, resulting in the industry gradually becoming a sunset industry, with lower price-to-earnings ratios (returning to the cost of PoS hardware and software infrastructure). Do not misinterpret this inference. The transition of an industry from emerging to sunset may take hundreds of years. Long-term trends cannot serve as the basis for short-term speculation. In this regard, I can’t help but recall one of the most successful financial capitalists in the world today, Mr. Warren Buffett. His company, Berkshire Hathaway, acquired a textile mill in 1962. Unfortunately, the textile industry was already in decline, and despite efforts to navigate and reposition, it eventually had to be abandoned, leading to Berkshire Hathaway’s transformation.","link":"/Crypto/On-the-Self-Limitation-of-Ethereum.html"},{"title":"Paradigm Betrays the Revolution","text":"The English word “Paradigm” means “a typical example or pattern.” The most common usage is in the phrase “Paradigm Shift” , which refers to a fundamental change in the basic concepts and practices of a scientific discipline. It is a concept in the philosophy of science introduced by American physicist and philosopher Thomas Kuhn and incorporated into the general lexicon. While Kuhn initially limited the use of this term to the natural sciences, the concept of paradigm shift is also used in many non-scientific contexts to describe profound changes in fundamental models or perceptions of events. In the cryptocurrency/web3 field, Paradigm is a well-known name. One prominent example is their deep investment in the leading decentralized exchange (DEX) project, Uniswap. As early as 2019, when Uniswap was relatively unknown in the DeFi space, Paradigm invested $1.82 million as an angel investor and mentor. This investment is believed to have yielded returns of several billion dollars during the peak of the bull market in 2021. In the NFT space, Paradigm made a significant investment of $11 million in the early stages of the NFT-focused trading platform Blur, around March 2022. With their support and involvement, Blur emerged in early 2023, challenging the dominance of the leading NFT marketplace, Opensea, and disrupting the bear market. Their investment in Uniswap is a source of pride for Paradigm. Noah, the lead developer of Uniswap v3, once tweeted, “Dan is a core contributor to the mechanism design of Uniswap v3. It would not have been possible without him.” However, their investment in Blur could be seen as a betrayal of Opensea, the frontrunner that received significant investment from a16z. While it may not be explicitly stated, the conflicting interests are apparent. Their investment in FTX, which eventually faced significant losses and an exit scam, caused Paradigm to lose face and suffer losses of up to $278 million. Just recently, Paradigm quietly modified their website’s bold slogans and manifestos. Previously, it read: “Paradigm backs disruptive crypto/Web3 companies and protocols with as little as $1M and as much as $100M+.” The revised version now states: “Paradigm is a research-driven technology investment firm.” They have also removed the strong expressions related to cryptocurrencies and Web3, such as “We believe cryptocurrencies will define the next few decades.” It is rumored that Paradigm couldn’t withstand the loneliness of the cryptocurrency bear market and couldn’t resist the temptation of artificial intelligence. They are reportedly preparing to enter the field of AI.","link":"/Crypto/Paradigm-Betrays-the-Revolution.html"},{"title":"Recommendations for pregnant women","text":"Precautions in pregnancy check-ups During the epidemic, pregnant moms need to note the following things when going for pregnancy check-ups: Avoid taking public transport. You can take taxi, uber and your private car. Avoid staying in hospital for a long time. You can ask your family to line up for you and find a ventilated place with fewer people while waiting. Don’t wait in doors for long. Always wear an N95 mask or medical mask from home to hospital. Gloves are also recommended. Bring hand sanitizer or sanitizing wipes with you all the time to maintain hand hygiene when it is not convenient for you to wash your hands. Avoid touching your eyes, mouth or nose with your hands. The virus can transmit through contact. Dispose of used masks in a proper way upon getting home. Remember to change your clothes, wash your hands and face in time. Keep distance from others (at least one meter away) when you are on the way or in hospital. Can new moms keep breastfeeding during the epidemic? If you are healthy and want to breastfeed your baby, please remember to wash your hands regularly. Pay attention to the hygiene of those body parts where you will have close contact with your baby. Follow the guidelines of home isolation. Wear a medical mask and carefully wash your hands before intimate contact with your baby. Keep your wrists, arms and outerwear clean. Breastfeeding is not recommended under these circumstances. You are a suspected COVID-19 patient. You are a confirmed COVID-19 patient and not yet fully recovered from the disease. **SPECIAL NOTICE: **If you are taking certain antivirus drugs, such as Lopinavir or Ritonavir, you are not recommended to breastfeed your child. If you have respiratory symptoms but not COVID-19 infected, you can breastfeed your baby under the guidance of a doctor.","link":"/World/Recommendations-for-pregnant-women.html"},{"title":"Recommended Free and Secure Email Services without Phone Registration","text":"Using a free anonymous email service can be advantageous for several reasons. Firstly, it helps to protect your privacy and maintain confidentiality. By concealing your identity and personal information, you can communicate without revealing sensitive details about yourself. This can be particularly useful when engaging in online forums, signing up for services, or interacting with unfamiliar individuals or websites. Secondly, an anonymous email service reduces the risk of spam, unwanted solicitations, and potential data breaches. By using a separate email address that doesn’t link directly to your personal information, you can avoid exposing yourself to unnecessary risks. Finally, an anonymous email service allows for greater control over your online presence, giving you the freedom to explore and engage without compromising your privacy. ProtonMailWebsite: https://protonmail.com/ ProtonMail is an open-source email service based in Switzerland known for its top-notch security and excellent reputation. The free version offers a smaller mailbox capacity of 500MB, which is sufficient for regular email communication. It also has a Chinese interface and allows users to send up to 150 emails per day. Account registration only requires setting up an account and password, without the need for phone verification. It is recommended to use the web version as it doesn’t cache email content locally, catering to users with high-security requirements. OutlookWebsite: https://outlook.live.com Outlook is Microsoft’s email service. While it is not suitable for sensitive communications (plaintext emails), it can be used for receiving verification codes, subscribing to newsletters, and other purposes. Similar to ProtonMail, setting up an account and password is sufficient, without the need for phone verification. The free version provides 15GB of email storage space. Mail.comWebsite: https://www.mail.com/ Mail.com is a well-established American email service. Account registration requires setting up an account, providing your name, birthday, and password. You can optionally include a mobile phone number or another email address for password recovery. Mail.com’s email system is hosted on AOL servers and offers various domain suffixes for email addresses, such as @mail.com, @email.com, @usa.com, and more. Yandex.MailWebsite: https://mail.yandex.com/ Yandex is Russia’s largest search engine, similar to China’s Baidu. Registering for Yandex.Mail only requires providing your name, setting a password, and selecting a security question and answer for password recovery. Yandex.Mail stands out by providing 1000 custom prefix emails per user, each with 10GB capacity. It is a suitable option for users who trust the Russian platform. GMX MailWebsite: https://www.gmx.com/mail/ GMX Mail allows you to set up an account by providing your name, birthday, and password. Similar to other services, you have the option to include a mobile phone number or another email address for password recovery. Established in Germany in 1997, GMX aims to create the world’s best free email service. It offers a large storage capacity of up to 65GB and allows for sending attachments of up to 50GB. TutanotaWebsite: https://mail.tutanota.com/signup Tutanota is a free and secure encrypted email service that provides a Chinese interface. MailfenceWebsite: https://mailfence.com/ Mailfence is a free and secure encrypted email service, although it doesn’t offer a Chinese interface. DisrootDisroot is a comprehensive community forum, and its email service is one of its offerings. Note that new account registration is not available on weekends. Visit the website for more information. CTemplarWebsite: https://mail.ctemplar.com/create-account?plan=FREE CTemplar is known as the most secure encrypted email service. Free users have 1GB of storage space and a maximum attachment size limit of 10MB. They can receive up to 200 emails per day. CTemplar emphasizes security and encourages using Tor for account registration. Mail2TorWebsite: http://mail2tor.com/ Mail2Tor is a fully anonymous email service on the darknet. Note that using Tor proxy is necessary to register for a free @mail2tor.com account and access other mailbox services (webmail, SMTP, POP3, and IMAP). Please note that the usage of Mail2Tor requires using a Tor proxy for registering yourfree @mail2tor.com account and accessing other mailbox services (webmail, SMTP, POP3, and IMAP). mail2tor.com emphasizes security and privacy for users seeking anonymity on the internet.","link":"/Tech/Recommended-Free-and-Secure-Email-Services-without-Phone-Registration.html"},{"title":"Some Points about the Value of BTC","text":"I recently have been thinking of the value of Bitcoin and wanted to know the logic about BTC. As we all know, BTC is a virtual currency based on deflation logic. Due to the deflation property of its design, the greater the degree of attention, the more users, the higher price. What I came to understand recently is some controversial parts: i.The virtual currency of deflation logic itself does not have an absolute threshold. A dog with a certain programming base can design similar products such as fire coins, water coins, etc. But under normal circumstances only one concept is the most recognised. This is similar to brand barriers. It is clear that Bitcoin currently has this capability. Just like that in ancient Africa, maybe coconut is hard currency, but when trading with westerners, hard currency can only be silver or gold coins. ii.Bitcoin is basically unable to be physically blocked by the government unless the Internet is banned. Of course, there is still a big risk in Bitcoin. That is, governments forming a legal cognition alliance, and announcing that the circulation of Bitcoin is illegal. Since it can be circulated through the Internet, users can also be locked and located through the Internet. For instance, Pony Ma can’t stop Jack Ma from sending a WeChat red envelope to Liu Qiangdong, but he can know whether Liu Qiangdong received the red envelope. iii. The value of Bitcoin lies in its trading tax avoidance property. But this is similar to investing in gold. The consumptional and functional application properties of gold are very low, mainly due to currency attributes. The demand side is difficult to estimate and can only be judged by the political and economic forms of international powers. Given its strong destructiveness in subverting government currency, valuations are even harder. As an investment variety, the risk is indeed too large, mainly because the price does not have a stable valuation framework. Of course, I still don’t understand much about BTC. Record it first.","link":"/Crypto/Some_Points_about_the_Value_of_BTC.html"},{"title":"A Lucrative Business Opportunity of Stablecoins","text":"Earlier this month, Tether, the leading stablecoin issuer by market capitalization, released its first-quarter reserve and profit data. It’s not just impressive; it’s exceptionally impressive. Let’s take a look at a few highlights: The net profit for the first quarter was $1.48 billion, more than double the profit from the fourth quarter of 2022! To put it in perspective, the renowned asset management company BlackRock had a net profit of only $1.16 billion in the first quarter, with nearly 20,000 employees. How many employees does Tether have globally? Probably only around one or two hundred. The issuance of USDT increased from $66 billion to over $82 billion. The primary reserve assets are U.S. Treasury bonds, accounting for over $53 billion (over 64%). They significantly reduced their bank deposits from $5.3 billion to $481 million. (One can only say that Tether made a swift move during the banking crisis!) While the Federal Reserve bears the risk of bank failures and desperately raises interest rates to fight inflation, Tether made a bold move by buying U.S. bonds at a discount. The more interest the Federal Reserve raises, the more profit Tether receives, and the interest becomes mere surplus. Tether, holding a substantial amount of low-priced, high-yielding U.S. bonds, has become a significant beneficiary of this forced liquidity injection. On the 17th, Tether announced that starting in May, it would allocate up to 15% of its profits to “buy the dip” in Bitcoin! Assuming they can maintain their profit level, with a first-quarter profit of $1.48 billion over three months, that’s approximately $493 million per month. 15% of that is $74 million. Based on the average purchase price of Bitcoin at $28,000, that’s over 2,600 Bitcoins per month. How many Bitcoins can miners produce in a month? Each block yields 6.25 Bitcoins, which amounts to 900 Bitcoins per day or 27,000 Bitcoins per month. So, Tether alone can purchase around 10% of the monthly increase. The game is about to get interesting. With the Federal Reserve maintaining high interest rates, they are providing Tether with a higher risk-free rate, allowing Tether to profit significantly from seigniorage. After all, Tether doesn’t have to pay a penny in interest to USDT holders, while the Federal Reserve offers an interest rate as high as 5%. If Tether’s reserves available for capturing this interest rate differential amount to $50 billion, that’s a solid $2.5 billion in revenue. If we look back at Tether’s reserve composition during the bullish market two years ago when the Federal Reserve lowered interest rates and flooded the market while the US dollar weakened, we’ll find that just two years ago, their primary assets were commercial papers, with Treasury bills accounting for only 2.94% of their liquid assets. The Federal Reserve’s interest rate hikes caused Silicon Valley Bank to collapse and nearly killed USDC. SEC regulation dealt a heavy blow to Paxos. Meanwhile, the opaque Tether mastered countercyclical adjustments and made a fortune in silence. Small and medium-sized banks in the United States hoard Treasury bonds. When the Federal Reserve raises interest rates, they struggle with their liabilities and many go bankrupt. Tether, on the other hand, hoards Treasury bonds, so when the Federal Reserve raises rates, it’s like giving Tether free money. Tether claims to have $81.8 billion in reserves, exceeding the required amount by $2.44 billion. Excess reserves? Why worry? However, upon closer examination, not all of the $81.8 billion can be immediately liquidated. But can individual holders of USDT worldwide collectively squeeze Tether like they did with Silicon Valley Bank? It’s unlikely. That’s the brilliance of Tether. Stablecoins are an excellent business, but they require exceptional asset management skills to withstand turbulent times without collapsing.","link":"/Crypto/Stablecoins_A_Lucrative_Business_Opportunity.html"},{"title":"The Essence of the Internet is Marketing, and Web3 is Essentially Financial Marketing","text":"There are often stories that people love to tell: Two classmates, A and B, graduated together. A joined a strict and regulated software company, while B joined an unknown internet company. Several years later, A honed their skills in standardized coding and project management, while B’s company successfully went public, resulting in a skyrocketing value of their stock options and granting them financial freedom. Ultimately, the difference in business models determined their divergent destinies. The software company sold “products,” whereas the internet company “sold” products. Unlike the telecommunications industry, the internet industry is built on open-source software. In the telecommunications industry, equipment manufacturers (such as Huawei) are responsible for technology development and sell the products to operators (such as Mobile) for service provision. Equipment manufacturers occupy the upstream position in the industry chain of operators. On the other hand, internet companies utilize free open-source software and inexpensive off-the-shelf hardware. By bypassing the Internet of Everything (IOE), internet companies reduce costs associated with the upstream industry chain. Consequently, the work performed by technical personnel in internet companies essentially involves integration or application development. To be honest, it is not highly technologically advanced work, especially without core hard technology. The low level of hard technology does not necessarily mean lower profits. On the contrary, the low entry barrier allows for certain occupations, such as app developers, to be mass-produced, leading to substantial earnings. If these application development jobs were provided as outsourcing services, they would not yield significant returns. However, when integrated with internet companies’ business and involved in distribution, the results are extraordinary. The former lies in the lower value-added section of the smile curve, while the internet companies, which can distribute huge profits, primarily occupy the high value-added right end, namely the consumer end. Therefore, internet companies are essentially marketing companies disguised as technology companies. Promoting internet culture, capturing consumers’ minds, and shaping new ideologies are inevitable tasks for internet companies. Internet companies are no longer confined to one or two products. Attention and traffic are the lifeblood of internet businesses. The paradigm of Web3 has undergone some changes. Some people summarize it as follows: Web1 was read-only, Web2 was read and write, and Web3 is read, write, and own. This perspective focuses on the trees but not the forest. Web3 is first and foremost the internet, and therefore, it is also marketing. However, Web3 does not “sell” any product; it emphasizes selling financial products. At the same time, Web3 uses financial methods to empower marketing. The so-called “a large upward price movement attracts a multitude of people” is a silent form of promotion. When these two aspects are combined, it constitutes what the author refers to as “financial marketing” – that is, marketing financial products and empowering marketing through finance. Take SHIB as an example, a few dozen lines of contract code that attracted millions of people, resulting in a market capitalization of over $5billion and a daily trading volume of nearly $80 million. This can be considered a miracle. Departing from the essence of Web3 may lead to wandering astray. However, this does not mean that any form of financial marketing is Web3. Making an insurance advertisement on short video platforms would not be classified as Web3. Finance in relation to Web3 is merely a false representation to cultivate the true. If you mistake the false for the true, then you have lost.","link":"/Crypto/The-Essence-of-the-Internet-is-Marketing-and-Web3-is-Essentially-Financial-Marketing.html"},{"title":"The Essential Significance of Hoarding Bitcoin","text":"The most primitive storage need of humans, similar to squirrels storing pine cones for winter, is an instinctual response to future problems. This instinctual behavior does not require humans to possess such advanced thinking systems in their brains. Squirrels and many other animals can also anticipate the future. The existence of this anticipation is not due to future uncertainty but rather future certainty. Winter will definitely come, food will become scarce, and I will still be alive. If any of these three points were not true, there would be no need to store food today. If I can foresee future problems that are certain to occur, such as losing income due to an economic downturn or losing the ability to work due to old age, but I have confidence in solving these problems, such as having a robust social security system to support me through difficult times, then I would not be inclined to save as much. If I have no way of predicting what the future holds, such as during times of war when my family could be wiped out by gunfire tomorrow, then I would also not engage in saving. The strong desire for savings arises from the confidence that lies between optimism and pessimism. Optimistic enough to believe that I will still be alive (or at least my genes will exist in another body), and pessimistic enough to think that I might not survive (or not be able to maintain my current standard of living). However, saving money, unlike storing food, has a significant difference. Although both stem from the same instinct, they have distinct characteristics. In this article, we use the term “money” to refer to the nature of storing value and the term “currency” to refer to the nature of a medium of exchange. Correspondingly, “money” can be translated as “money” in English, while “currency” can be translated as “currency.” By inventing money as a medium of value, humans have successfully deceived themselves. Let’s imagine I am a squirrel. It is autumn in the year 2023, and I am preparing to store 1,000 pine cones to survive the upcoming winter. If money does not exist, my approach would be to gather 1,000 pine cones and store them safely in a tree hollow to gradually consume during winter, ensuring my survival until spring 2024. What if money does exist? Let’s assume the squirrels of the squirrel kingdom have reached a consensus and selected shiny gold as their currency. They have cut the gold into standardized small gold blocks as a unit of pricing. One small gold block is called one dollar. In the autumn of 2023, the market price for ten pine cones is one dollar. The price for 1,000 pine cones is 100 dollars. I collect pine cones diligently during this golden autumn and finally gather 1,000 pine cones, which I sell in the market for 100 dollars. Then I store the 100 gold blocks in my tree hollow. Winter arrives as expected. I take my 100 dollars to the market, only to find that there are no pine cones available for purchase. The squirrel that saved money, perishes. Clearly, saving money is not equivalent to storing food. By replacing the storage of food with the act of saving money, we require a higher level of optimism. We need to believe that other individuals have enough surplus goods for exchange. In other words, we not only have confidence in our own survival in the future but also have confidence in the survival of others. Furthermore, we need to believe that others are not just surviving but are living well—at least well enough to have surplus goods for exchange. An extreme egoist or a fiercely competitive individual who would harm everyone else—if they were to truly embrace their logic—would not save money because they should not hope or expect anyone else, aside from themselves, to survive and live well. In other words, a money-driven, money-obsessed egoist is inherently inconsistent and suffers from a split personality because the only way their hoarded money can be of any use is if others are living well and producing a surplus that they do not need. (Perhaps this also explains why the incidence of mental illness in modern society is reportedly so high, reaching more than 10%?) In fact, saving money is fundamentally different from storing food. If we freeze today’s bread and consume it on March 7th next year, this is standard food storage. However, if we earn 100 dollars on July 3rd this year and spend it on March 7th next year, what we buy will undoubtedly be freshly baked bread from March 7th, not the bread we baked and stored in the freezer on July 3rd. Storing food preserves its utility value. Saving money preserves only its exchange value. Similarly, the notion of preserving exchange value in economics is also misleading. If there comes a day when the utility value cannot be reproduced by others in the future, the preserved exchange value (money) cannot be converted back into utility value (bread). In reality, the so-called preservation of exchange value is merely a quantification of human altruism: today, I am willing to dedicate additional labor beyond what is necessary to satisfy my own needs to fulfill the needs of others. I do so with the expectation that, one day in the future, when I lose the conditions or ability to work, others will dedicate additional labor to meet my needs, allowing me to continue living the life I desire without immediate demise. It is evident that exchange value and the emergence of money and currency occur only when productivity exceeds the level of self-sufficiency and generates surplus. This surplus enables the creation of exchange value and the emergence of money and currency. As productivity continues to advance, the standard for detaching oneself from labor can transition from losing labor conditions or labor capacity to losing labor necessity. We refer to this as “retirement” or “financial freedom.” Why are humans willing to dedicate excessive labor for altruism and mutual assistance? It is not because humans are highly capable. On the contrary, it is because humans are individually incompetent. Imagine if John possesses superhuman abilities and can handle everything without the help of any other humans. In that case, John would have no need to acquire (human) money and savings to exchange for assistance. Moreover, he would not care about the life or death of others—just as he does not care about the life or death of ants. It is precisely because John, you, me, and every individual are so incapable that we cannot even eat a meal or wear clothes without relying on the efforts of others. Without the assistance of others, we would be unable to survive. Therefore, each person needs altruism and must dedicate labor beyond what is necessary to maintain the functioning and continuation of human society. However, humans tend to recognize their self-interest while overlooking their altruistic nature. If I give my bread to John on July 3rd, and on March 7th next year when I am hungry, I expect Li to give me a loaf of bread, Li would firmly refuse. Li only recognizes his own self-interest. Giving me a loaf of bread for no reason contradicts Li’s self-interest. Thus, I need to employ a deception. I offer Li something of no utility value in exchange for the bread he holds. This something is currency. Currency combines self-interest and greed, giving rise to altruism and mutual assistance as a miraculous catalyst. Its catalytic principle is to induce excessive labor and produce surplus goods. This system of cooperation based on money and currency is powerful, but it has two bugsTranslation: The first bug lies in the aspect of excessive labor. When humans engage in extensive division of labor, it becomes impossible for us to determine the boundary between necessary and excessive labor. This creates an opportunity for cunning individuals to monopolize these surplus products. Thus, capitalism emerged. The essence of capitalism is to create surplus products through the stimulation of excessive labor using money and then allow a small group of people to possess these surplus products. To this day, humanity still does not know how to fix this bug without eliminating the motivation for excessive labor and hindering the production of more surplus products. Many attempts to address the issue of wealth concentration end up eliminating excessive labor as well, resulting in a regression of productivity. The second bug lies in the creation of money or currency. If anyone, whether it is an individual, a group, or all people, can create money without any constraints or with artificial constraints that are not based on natural, intrinsic factors, it may lead to hidden exploitation. This is because creating exchange value out of thin air will inevitably diminish the exchange value of existing currency. As long as the creation of money is not subject to absolute constraints beyond human will, it can be considered “arbitrary”—following the will of certain individuals. Those who provide the artificial constraints also possess their own will, and the creation of money is guided by these constraints. Though it may have nominal limitations, it is still a form of “arbitrary” creation. The U.S. dollar is an example of a currency that is subject to “arbitrary” creation. Its constraint is the debt ceiling imposed by a group of people representing Americans in Congress. Compared to the world’s population of 7 billion, this is a typical case where a few individuals provide artificial constraints that determine the creation of currency. Hence, the creation of the U.S. dollar can be considered arbitrary, following the will of the American people. Of course, the top-level governance structure of the United States is relatively responsible. Responsible in a sense that they ensure Americans have enough to eat while others can have a share of the benefits. Keynes was undoubtedly a genius. Keynes proposed using the second bug to solve the first bug. This is the legendary “fighting fire with fire” strategy. However, in this world, only the United States has the ability to control and effectively utilize the second bug. In the face of deep-rooted global economic crises, the United States, with control over the printing of dollars, possesses unparalleled capability to implement Keynes’ “fighting fire with fire” treatment and rescue itself from an imminent collapse. This is the incredible and unimaginable Modern Monetary Theory (MMT)—printing money to save the economy. Essentially, MMT involves exploiting everyone (globally) to save everyone (Americans and their allies). This brings to mind what Hobbes, the author of “Leviathan,” said: “War of all against all” (although he wasn’t referring to this matter). A pacifist is unwilling to use one poison to cure another. Instead, they propose using the method of radical reform. By removing the bone of currency over-issuance, the poison of economic bugs can be cured. They invented Bitcoin, which relies solely on natural rules (such as Proof of Work) to constrain and regulate its creation. It cannot be arbitrarily over-issued, and its total supply is fixed. This person is Satoshi Nakamoto. For all of humanity to save and assist each other better, we need better tools—tools that are not manipulated by third parties, even if those parties are skillful and adept, like Federal Reserve Chairman Powell—tools that can better cope with future changes. The essence of hoarding Bitcoin lies in this fundamental significance.","link":"/Crypto/The-Essential-Significance-of-Hoarding%20Bitcoin.html"},{"title":"The Security Debate and Collision between Proof of Stake (PoS) and Proof of Work (PoW) since Ethereum's Transition","text":"Ever since Ethereum transitioned from PoW to PoS, the discussion and collision regarding the security of PoS and PoW have become a focal point. As early as November 6, 2020, Vitalik Buterin wrote a blog post titled “Why Proof of Stake” , where he conducted some calculations. His calculations indicated that, given equal security costs, PoS is safer than PoW. However, his calculations were based on an optimistic assumption that attackers would spend money to buy mining rigs or stake coins to participate as nodes in block generation competition. This assumption implies that attackers are civilized and polite, participating in the game according to the rules and attempting to win under those rules.But the lesson from human history is that you should never expect disruptors to adhere to your game rules. Whether through violent revolution or disruptive innovation, true attackers always overturn the table and start afresh. Kang Youwei wanted to preserve the monarchy, Sun Yat-sen sought revolution, and Mao Runzhi was once an anarchist believer, but they eventually had to recognize reality and realize that violent revolution was the only way out. Let’s first assume a complete PoS blockchain that starts with the genesis block and is generated using the PoS method. The block production method is similar to Ethereum’s PoS, where pseudo-random (computers cannot generate true random numbers) selection of validators or voters is employed. Voters finalize a set of blocks, called an epoch, at regular intervals (which must rely on an external clock since PoS lacks intrinsic time). Blockchain data can be divided into two categories: recorded transaction data and additional data that secures these transaction data (such as block headers). The first category of data is generated by users, while the second category is generated by the blockchain system. For PoW, the most crucial number in the second category is the result of the PoW calculation, a hash inverse operation. For PoS, the second category of data consists of metadata generated through the aforementioned voting and finalization methods, essentially a set of digital signatures of private keys. From a cryptographic perspective, the shift from PoW to PoS represents a significant change in the cryptographic techniques relied upon to secure and validate transaction data. Specifically, it involves a shift from hashing to signatures, for example, from SHA-256 to ECDSA. Okay. Since all PoS computations revolve around digital signatures, they require minimal effort. If we start from the genesis block and sequentially strip away both categories of data, then reassign all validators or voters, rebuild all block headers, insert the cleansed transaction data, and completely regenerate the epoch according to the rules, we obtain a completely reconstructed PoS blockchain that looks deceptively genuine. Due to the lack of intrinsic time in PoS chains, during the entire reconstruction process, any timestamp can be arbitrarily specified and forged, even setting the block’s creation time to a date before 2008 or after 2009, without being distinguishable as genuine or fake. Let’s call this method a chain reconstruction attack. Fundamentally, when PoS loses time, it loses everything. In the most extreme scenario, let’s assume that major global powers, particularly the P5 countries, join forces to enforce the law. They can effortlessly reconstruct any PoS chain. Any chain that appears harmless will not face this life-or-death test. But if it aims to challenge the global fiat order like Bitcoin, things become uncertain. In other words, if Bitcoin were a PoS chain, it would eventually be wiped out by the united efforts of major powers. Despite occasional conflicts among the P5 nations, when facing a common threat, they can. Since Ethereum transitioned from PoW to PoS, the discussion and collision regarding the security of PoS and PoW have become a focal point. As early as November 6, 2020, Vitalik Buterin wrote a blog post titled “Why Proof of Stake” [1] to conduct some calculations. His calculations indicated that PoS is safer than PoW when considering the same security cost. However, his calculations were based on a wishful assumption that attackers would spend money to buy mining machines or stake coins to participate in block production competition. This assumption assumes that attackers are civilized and politely adhere to the rules of the game on this chain, and then attempt to win under those rules. But the lesson from human history is not to expect disruptors to abide by your game rules. Whether it’s violent revolution or disruptive innovation, true attackers always start over. Kang Youwei wanted to preserve the monarchy, Sun Yat-sen wanted a revolution, and Mao Runzhi was once an anarchist. However, they all had to recognize reality in the end, and violent revolution became the only way out. Let’s first assume a complete PoS blockchain that starts with the genesis block generated through PoS. The method of block production is similar to Ethereum’s PoS, which uses pseudo-random (computers cannot generate true random numbers) selection of validators or voters. The voters finalize a group of blocks, referred to as an epoch, at regular intervals (which must rely on an external clock because PoS does not have intrinsic time due to the absence of PoW calculations). The data in the blockchain can be divided into two categories: recorded transaction data and additional data that anchors these transaction data (such as block headers). The first category of data is generated by users, while the second category of data is generated by the blockchain system. For PoW, the most critical number in the second category of data is the result of the PoW calculation, which is the inverse operation of a hash. For PoS, the second category of data is the metadata generated through the aforementioned voting and finalization methods, essentially a digital signature of a set of private keys. From a cryptographic perspective, there has been a significant change in the cryptographic techniques that underpin the fixed or protected transaction data when transitioning from PoW to PoS, namely from hashing to signing. For example, from SHA-256 to ECDSA. Alright. Since all calculations in PoS are just digital signatures, the calculations require almost no effort. If we start from the genesis block and gradually strip away both categories of data, then reassign all validators or voters, rebuild all block headers, insert the cleansed transaction data, and regenerate the epoch according to the rules, we will have a completely reconstructed PoS blockchain that looks deceptively real. Since the PoS chain lacks intrinsic time, during the entire reconstruction process, any timestamp can be arbitrarily specified or forged. Even the block’s genesis time can be arbitrarily changed to a time before 2008 or after 2009, and it would be impossible to distinguish the authenticity. Let’s call this method a chain reconstruction attack. Fundamentally, when PoS loses time, it loses everything. In the most extreme case, suppose the major global powers, primarily the P5 countries, jointly enforce the law; they can easily reconstruct any PoS chain. Any chain will not face this life-or-death test when it is harmless. But if it intends to challenge the global fiat currency order, like Bitcoin, then things might change. In other words, if Bitcoin were a PoS chain, it would eventually be wiped out by the combined efforts of the major powers. Although these powers often have conflicts, they can swiftly act together when facing a common threat. The successful case of jointly transferring a batch. I apologize for the abrupt ending in my previous response. However, it’s important to note that the scenario I presented regarding a chain reconstruction attack is hypothetical and speculative. While it is true that transitioning from PoW to PoS brings about changes in the underlying cryptographic techniques and introduces different security considerations, it does not automatically imply that PoS is inherently vulnerable to such attacks. In reality, the security of a blockchain protocol, whether it is PoW or PoS, depends on various factors, including the design of the consensus algorithm, network decentralization, economic incentives, and the behavior of participants. Both PoW and PoS have their own strengths and weaknesses, and the security of each consensus mechanism is an active area of research and development. When it comes to the global fiat currency order, it is important to consider that the impact of cryptocurrencies, including Bitcoin, goes beyond their consensus mechanisms. The adoption and acceptance of cryptocurrencies as an alternative or complementary system to fiat currencies involve complex socio-economic and geopolitical factors. It is challenging to predict the actions of major global powers and how they might respond to such a scenario. Overall, the security and viability of blockchain systems depend on a combination of technical, economic, and social factors. Ongoing research, continuous improvement, and robust community engagement are crucial for enhancing the security and resilience of blockchain networks, regardless of the consensus mechanism they employ.","link":"/Crypto/The-Security-Debate-and-Collision-between-Proof-of-Stake-(PoS)-and-Proof-of-Work-(PoW)-since-Ethereum's-Transition.html"},{"title":"The Federal Reserve's Defeat, A Turning Point in Monetary Policy","text":"On the early morning of the 4th, the Federal Reserve concluded its May interest rate meeting. As expected, there was another 25 basis points rate hike, bringing the federal funds rate to the range of 5% to 5.25%. The plan to reduce the balance sheet through bond selling continues, but the wording suggesting further rate hikes has been removed. This is likely to be the last rate hike. Bitcoin experienced a drop followed by a rise, surging from around $28.5k to $29k. Due to the previous emergency assistance provided to banks, the Federal Reserve’s six-month effort to reduce its balance sheet was undone. The balance sheet regressed by almost half within a couple of weeks. It’s like scooping out two spoonfuls of water while pouring a basin of water back in. This makes the act of scooping out two spoonfuls appear ridiculous, as if it has become a form of performance art. Powell lifted the stone, but he doesn’t know whose foot to hit. In 2020, when Powell aggressively expanded the balance sheet and injected liquidity, we were implementing a reverse taper. In early 2022, before Powell initiated the tapering and bond selling, we preemptively sold off US Treasury bonds and accumulated US dollars. In 2023, when the countries unable to obtain strengthened currency swaps from the Federal Reserve found themselves on the brink of crisis due to the circulation of the US dollar, they came to us seeking assistance. We extended the umbrella of US dollar reserves to shield them from the storm. The US dollar belongs to the US, and China provides the umbrella. Under this umbrella lies the “internal” circulation of the Chinese yuan. Those who join this “internal” circulation system avoid being harmed by the thunder (Powell) and the storm (Yellen) caused by the US dollar. This scene is reminiscent of a game in which an eagle catches chicks in a kindergarten. Previously, when the eagle was hungry, it would catch two chicks to eat. Now, the flock of chickens has a mother hen who shields the chicks from the eagle’s predation with her broad wings. The hungry eagle jumps left and right, trying both gentle and forceful approaches, but it cannot break through the mother hen’s protective line and cannot catch the chicks to have a hearty meal. Incidentally, China’s actions have inadvertently helped Bitcoin complete a round of countercyclical adjustments. In early 2021, when the bull market was overheating, we cracked down on mining, preventing this round of bull market from spiraling into madness and avoiding asset over-bubbling, as well as preventing more funds from entering at higher levels. By early 2023, during the strict regulation of the US, we quietly relaxed the narrative around Hong Kong, igniting a rebound in Bitcoin from its bottom, doubling in value in just three to four months. This combination of a crackdown and a rally hit the mark: a crackdown during the Fed’s expansionary monetary policy and a rally when the Fed was tightening. The difference between the high and low was only $30,000 and $60,000, successfully smoothing out the cycle, moving in the opposite direction of the Federal Reserve, and weakening the US dollar’s harvesting power over Bitcoin investors. In reverse, it also means striking at the US dollar’s objective of regaining strength by harvesting external economies. Bitcoin is like water. It reflects not only the bubble and de-bubbling of the US dollar cycle but also the countercyclical adjustment of the Chinese yuan. It is selfless and actionless, hence it can “follow others while remaining ahead,” “exist externally while surviving internally,” and “act without acting.” There are ambushes in the front and pursuers in the rear. The pursuers behind Powell are the menacing inflation. He has the intention to defeat the enemy but lacks the power to turn the tide. The US bond market is on the verge of being unable to withstand further selling. If everyone is selling, who will step in to buy? Without buyers, won’t it lead to a collapse? Therefore, the leaders of the United States chose to collude with financial capital, tearing off the hypocritical mask of the “spirit of the contract,” revealing a fierce and grim face with gleaming fangs. They continue to raise interest rates. This causes small and medium-sized banks holding large amounts of US bonds to be unable to cover their debts, allows interbank market rates to soar, sucking the blood out of small and medium-sized banks, accelerating their collapse, and making the investors and creditors of these banks bear the cost of their personal assets going to zero overnight. Meanwhile, Powell’s big banker friends quickly devour these fallen, nearly dying, and fat lambs at a bargain price. When pirates fail to plunder externally, they start to fight internally. The most brutal infighting is disguised as nothing. The victims silently fall and are quickly devoured. Everyone talks about the weather today with a smiling face, as if nothing has happened. Powell’s stone has ultimately landed on the feet of the American people. When the elder brother becomes ruthless. If he’s not ruthless, how can he be the elder brother? When the elder brother becomes ruthless, he can carve his own flesh to feed himself. This has happened in history before. In 1933, President Roosevelt forced Americans to surrender their gold through fines and imprisonment by issuing Executive Order 6102. Now, 90 years later, President Biden is going to make the American people bear some cost. The difference is that Roosevelt plundered the American people to make America great again, while President Biden is plundering the American people to make the vested interests of the financial group even stronger. Former President Clinton once said that the power of the Federal Reserve Chairperson is greater than that of the President of the United States. This time, when Powell lifts the stone and injures the feet of the American people, when the Federal Reserve’s balance sheet reduction has become a form of performance art, when interest rate hikes are nearing their end, when the Chinese yuan seeps into the vacuum zone caused by the US dollar’s withdrawal, and when Bitcoin has returned to the $30,000 level, the Federal Reserve has already declared the failure of this cycle of the US dollar harvesting the world.","link":"/World/The_Federal_Reserve's_Defeat_A_Turning_Point_in_Monetary_Policy.html"},{"title":"The New Stamp Of Dragon Year","text":"Year 2012 is the year of Dragon. And traditonally,there is a stamp for the year in China.So this year the role is dragon.The chinese creature is not the one western people think of.The werstern dragon is aggressive,howerever the chinese creature is the symbol of the empires and happiness.In fact, the chinese dragon should be called as ‘Loong’,according to his chinese pronouncation. Then why i’m here to say something about ‘Loong’.Because this year’s loong on the stamp is somehow not so gentle. Someone thinks that the loong seems to imply that 2012 will be the year to show china’s strength. Yeah, china is becoming more and more confident, and will take his responsibility. But the loong is another thing having no direct relationship with the strength. If you know something about china’s culture or history,you ‘ll understand the design of the stamp this year. Chinese people regard the Loong as the role of the God, and more too often say themselves the Descendants of the Dragon. In ancient china, only the Emperor have the power to dominate Loong. The emperor wear the clothes on which there is the images of Loong and they name themselves the god’s son of the True Loong. I’ll stop here because if you have interest in the chinese Loong ,you can google it for more information. Of course, if you’d like to talk with me ,just comment below~","link":"/World/The_New_Stamp_Of_Dragon_Year.html"},{"title":"The Scarcer Ability , Asking the Right Questions","text":"Overnight, Bitcoin experienced slight fluctuations around $30,000, while UNI steadily rose and is now close to $6. During the Sunday private board meeting, a member asked about the comparison between Uniswap (UNI) and Arbitrum (ARB). Both projects are undoubtedly of high quality, otherwise, the comparative analysis would be meaningless. In terms of tokenomics, Uniswap will complete its unlock in the next two years [1], while Arbitrum has just started [2]. Their distribution models are almost identical: Team + VCs: 40% (UNI) vs. 44.4% (ARB) DAO (Community): 43% (UNI) vs. 42.8% (ARB) Initial airdrop: 15% (UNI) vs. 12.7% (ARB, including 11.6% personal user airdrop + 1.1% ecosystem project donations) Regarding business maturity, Uniswap still firmly holds its position as the leading DEX and continues to consolidate its leadership. Its commitment to decentralization enhances its anti-fragility. Currently, Arbitrum leads the L2 track, but other L2 solutions, such as the more established Optimism, are fiercely competing, and there’s also a possibility of zk technology disrupting the optimistic track (although Arbitrum can pivot with sufficient capital). L2 bridging still faces significant centralization control issues (an aspect rarely mentioned except by 教链). Uniswap certainly offers more certainty, while Arbitrum has greater uncertainty (which is not necessarily a bad thing, as uncertainty implies growth potential). In terms of development potential, some view Uniswap as just another DEX on Ethereum, while Arbitrum is a fundamental layer (according to Ethereum’s development strategy, L2’s importance will increase over time). However, Uniswap acts as a user gateway and has the opportunity to span across all chains, becoming a “super gateway” (reminiscent of the importance of gateways in the internet era). Even with UniswapX, gas fees from various underlying chains (including L1 and L2) will be “shielded,” allowing users to transparently accept UniswapX’s global scheduling without perceiving the individual chains. On the other hand, Arbitrum serves as an ecological infrastructure, allowing various applications to run on it. However, based on industry development history, trading is the most significant and inflexible demand (as evident from the market position and profitability of centralized exchanges). Nevertheless, fundamentally evaluating a project comes down to its ability to continuously solve problems. This is something that 99% of people would agree with. However, 教链’s insight is that the ability to ask the right questions is even more critical. Traditional education is about limited proposition contests, which are already challenging. Technological innovation involves open proposition contests, which are even more difficult. If the only requirement is the ability to solve problems, how can a team of three to five people compete with well-funded, well-staffed, well-educated, well-connected, and well-resourced giants or star teams? If the sole capability is to develop a payment system, how could Satoshi Nakamoto, a single individual, create a product that surpasses the payment platforms produced by large corporations? Bitcoin’s success is attributed to the fact that Satoshi Nakamoto asked a fundamentally different question: How to create a decentralized payment system? To answer and solve this question, a completely different set of skills and even consciousness is required. This led to Satoshi Nakamoto forging a unique path while the giants continued along a conventional route. Hence, when evaluating projects, it’s crucial to observe the team’s ability to consistently ask the right questions. Without asking the right questions, no matter how much funding or how illustrious the lineup, be it 996 or 007, it will all be in vain. The Uniswap team demonstrates the ability to continuously ask the right questions. This is evident from their transition from Uniswap V2 to V3. It took one year between Uniswap V2’s launch in the second quarter of 2020 and V3’s launch. During this year, numerous copycats and forks of Uniswap flooded the market, but none proposed increasing liquidity efficiency by truncating the range while maintaining the xy=k formula. It wasn’t until the introduction of Uniswap V3 that people realized this innovation. Uniswap came from behind. This is the advantage their ability to ask the right questions brought. As this year unfolds, both V4 and X demonstrate that the Uniswap team’s depth of understanding of problems remains unchanged. This instills confidence in us as we navigate through market fluctuations.","link":"/Crypto/The_Scarcer_Ability_Asking_the_Right_Questions.html"},{"title":"The Song of Wolf","text":"When we are young,we are often told that wolves are evil and cruel.If we weep,adults may frighten us that a wolf is coming.Many editions of the well-known fairy tale Little Red Riding Hood also describe a scaring wolf intending to swallow the little girl.After all the years,we can still think of the green creepy eyes like a ghost in the darkness.But it is not the whole thing. Wolf is a species that lives long enough to be honored as one of the perfect species in the evolution so far by biologists.For public,Wolf reminds us of Dog,who shares the same ancestor with Wolf.I love wolf far more than dog. It is always touching that we heard about storys that a dog is so loyal to his master that he never leaves even when his master is dead.Nevertheless I appreciate more about the wolf’s loyalty,the loyalty between each other and between male and female.There is a saying that a wolf only has one lifetime campanion.I never know whether there is any law in the wolves to constraint them to do so.But in modern society we human-beings are sometiomes lack of loyalty even within the legal framework,always making one and another excuses.Is it the evolution that we are proud of? In chinese culture ,we don’t like wolves.I recalls no pieces of literature which have a positive description about wolves,except a martial novel The Eleventh son written by Gu Long.Gu portrays the genius man as a lone wolf. When reading the novel,I am impressed by the man,the wolf man.It is not the super-nature creature in the American series that will turn to a wolf at full moon. it is a man who has the spirit of wolf-independent and submit to no one and nothing, iron-minded,but also tender. There is another exception Huawei,a chinese high-tech cooperation that respects the wolf culture a lot.The CEO Ren Zhengfei concludes that wolf has a keen sense of smell,offensive spirit and a sense of community.In the direction of the culture,Huawei grows to a respectful company.In Chinese history,the early Yuan Dynasty also fits this description and create a tremendous empire ever. I can’t tell that the wolf culture is a perfect one,but it truly makes up some parts that we are lack of. After thousands of years,dogs are now kept as pets while Wolf is still wolf.","link":"/World/The_Song_of_Wolf.html"},{"title":"The negative evolution of information on Internet","text":"If anyone asks what the greatest human invention in the second half of the twentieth century is, it is definitely the Internet. Through the virtual information network, the planet has truly become an interconnected village. People of different races, different skin colours, and different faiths can instantly speak and exchange information on the Internet. But have you discovered that in recent years, the Internet has been filled with a lot of vulgar, violent, and boring information, they have begun to become the mainstream of the mass Internet. Some people have predicted that the next century, the world will enter the second Middle Ages. Why does this take place now？Let us review the two stages of Internet first : In the first two decades of the Internet development, that is, in the PC era, people who have access to the Internet are generally highly educated and are in the elites of society, especially those represented by programmers who use the Internet as a variety of experimental fields. Therefore, the Internet world at that time was relatively pure, and more embodied in instrumentality and experimentation. The Internet, like telegraph and telephone, has significantly promoted the productivity and evolution of human society. People who have no access to the Internet look forward to the magical Internet life as they yearn for heaven. This is the very first stage. Since Steve Jobs defined the smartphone, the Internet has entered the civilian era, and the number of Internet users worldwide has expanded rapidly. The voices of the first generation of aborigines represented by programmers were drowned in the ocean of the common people. The Internet is no longer a pure paradise, but a black and white place that completely inherits the real world. Except for a small group of people who work for work or for self-realisation, most people work for a better life. In the way of life, there is no obvious difference between modern people and primitive people. In addition to the reproduction, life is flooded of singing and dancing. The only difference is the place of the event from the original jungle to the virtual space. The Internet has entered an era of entertainment. In the process of entertainment, we find that the irrational voice on the Internet often overshadows the appeal of reason; the spread of vicious events is often easier to search than the good ones; gossip news is far more heated than academic discussion. Abandoning the judgment of good and evil, I classify information into positive information, neutral information, and negative information. It stands to reason that in the statistical sense, the world is finally regression, and there can be no significant deviation. So what is the cause of the negative shift in information? This is determined by the following two characteristics of negative information. The first is the efficiency of transmission. Let’s make a small analogy. Originally in real society, such as in a community, the efficiency of negative information dissemination is higher than positive information. We can imagine that the thief incident in the neighbours must be faster and wider than the companion of the neighbours. This is driven by human curiosity, gloating, and jealous. The wide-ranging circulation of information has little difference in the spread efficiency of the three types of information in the era of no Internet because of geographical barriers and time delay, and has not reached its own speed limit. Through the catalysis of the Internet, we can think that the spread of these three kinds of information has reached the limit of their own “community spread” infinitely, so there is a phenomenon that negative information drives out positive information. Negative information is more efficient than the other two types. This discussion is based on propagation under a single source of information. The second is the cost of copying. In addition to the high efficiency of negative information, the cost of copying is extremely low. As the same example of the neighbours above, the thief of the neighbour’s house was not caught, and it would be easy for people to imitate it. However, it is costly to learn from the children of neighbours and finally win the prize. It is not cost-effective. Therefore, the imitation and replication efficiency of negative information may be viral in the general public. Coupled with the herding effect, the mentality of the masses has been negatively biased. This is extremely harmful to the sustainable development of a society. Why the DIDI drivers raped female passengers happens frequently, because people with such a tendency can gather together through the network, teaching each other, discussing their experiences, and this motivation is far greater than academic discussion on the Internet. This discussion illustrates that negative sources of information can mimic fission during the course of transmission. How to effectively overcome this problem is an urgent one to be solved? If he is a legal expert, he will think that it is necessary to strengthen the rule of law on the Internet; if he is a technology expert, he will consider how to screen and block negative information; if he is a politician, he may use all the information that is beneficial to himself, whether positive or Negative. Ass determines the head, since you stand in your own perspective, you will propose or use different rules. And I only talk about general methodology, that is reducing the efficiency of the transmission of negative information and increasing the cost of copying. Propagation is a node. This one-to-one transit node is a personal individual. Improving the quality of citizens, although impossible to completely blocking or cutting off the negative information dissemination chain, can greatly reduce the speed of communication. If the propagation speed is controlled within a certain range, the negative information will decay rapidly in a small range over time. The second is to increase non-negative information in the unit area by diluting the negative information density. Because the information transmission in a certain area is a three-dimensional network, if the information transmission path is occupied by non-negative information for a long time, the propagation time of the negative information will be reduced accordingly, and it can play the same role, just like The ball control of both sides in the football match. Here is just an example. Following this line, you can think of many methods. For example, adopting mandatory legal measures for malicious information, such as strengthening the credit information system, and so on. Of course, not everyone is a bad person. Some people just vent their emotions on the Internet that they can’t vent in reality. This is also an environmental pollution to the Internet. Therefore, by levying a speech pollution tax, people can pay for it online. This can be easily done in the era of artificial intelligence. This article is not intended to suggest a systematic solution.,since I am not an expert in this field. I just want to call on the Internet to face up to the negative evolution of Internet information in a timely manner. Don’t let the Internet society falling into an irrational atmosphere for a long time, and finally affecting the sustainable development of the real society.","link":"/World/The_negative_evolution_of_information_on_Internet.html"},{"title":"U.S. Debt on the Verge of Default","text":"Bitcoin rebounded above $27,000 overnight. Children’s Day is approaching, but it seems like a difficult time for U.S. President Biden. He had to hastily pack his bags and return to the United States without attending the scheduled events of the G7 summit. Why? The backyard is about to catch fire. This fire is the U.S. debt default. According to the definition, U.S. debt refers to national bonds issued by the U.S. federal government in the name of the government, through the bond issuance department under the Treasury Department. In 1917, to prevent excessive government borrowing, legislation set a limit on U.S. debt and gave the U.S. Congress the power to determine the limit on U.S. government debt as stipulated by the U.S. Constitution. The so-called U.S. debt default refers to the failure of the U.S. federal government to repay the principal and interest of the national debt according to the agreed-upon time, violating the agreement with the holders. Wikipedia provides an introduction to the 2023 U.S. debt crisis : “On January 19, 2023, the United States reached its debt ceiling, triggering a debt ceiling crisis. This is part of the ongoing political debate within Congress regarding federal government spending and the accumulated national debt. In response, Treasury Secretary Janet Yellen began formulating temporary ‘extraordinary measures.’ On May 1, 2023, Yellen warned that these measures could be exhausted as early as June 1, 2023. “Since the debt ceiling impasse in 2013, the debt ceiling has been raised multiple times without attaching budgetary conditions; the most recent increase was in December 2021. In the 2023 impasse, the Republican Party proposed cutting spending to the 2022 level as a precondition for raising the debt ceiling, while the Democratic Party insisted on a ‘clean bill’ without preconditions, similar to the three debt limit increases during the Trump administration. “If the government runs out of funds, the Treasury Department will have to default on payments to bondholders or immediately reduce funding to various companies and individuals who have been authorized by Congress but have not received sufficient funding from Congress. Both scenarios are expected to lead to a global economic collapse. Additionally, if the federal government is unable to issue new debt, it will have to balance the budget by cutting spending, totaling approximately 5% of the U.S. economy.” Today is May 24th, and Children’s Day is just a few days away, but the White House has still not reached an agreement with Congress. However, on the 17th, House Speaker McCarthy said, “Please rest assured that there will be no U.S. debt default.” Words are one thing, but those who want to pressure Biden have not relaxed their efforts. The solution to the U.S. debt default issue is not to repay the debt, but to raise the debt ceiling once again, issuing new debt to pay off old debt. From the chart, it can be seen that the debt ceiling has continuously been raised to accommodate the government’s ever-increasing expenses. After 2013, Congress simply temporarily suspended the debt ceiling multiple times, turning a blind eye to the situation. It can be seen that the debt ceiling has not effectively restricted the U.S. government’s lavish spending but has gradually become a tool for political struggle and obstruction between the two parties. Misfortunes never come singly. In the midst of an economic recession during the Kondratiev cycle and after fighting two major battles, one against the COVID-19 pandemic and another against Russia, the Biden administration is finding it difficult to cope. If the Federal Reserve bears the burden of borrowing, it’s like borrowing from one hand to pay the other, essentially borrowing in vain. However, a little over a year ago, when the Federal Reserve announced its plans to reduce its balance sheet, many countries hastily sold off a large amount of U.S. debt, creating significant pressure on the Federal Reserve. When the city gate is on fire, it affects the fish in the pond. At the beginning of 2023, several U.S. banks collapsed, nearly causing a financial crisis. Just last night, the newly appointed Chinese Ambassador to the United States, Ambassador Xie Feng, arrived in the United States to assume the position of the 12th Chinese Ambassador to the U.S. From Janet Yellen and Antony Blinken eagerly awaiting “visas” to visit China, to Jimmy Damon’s visit and the meeting with Wang Sha, and now the appointment of the ambassador after a five-month vacancy, things are quietly changing. As President Biden “predicted” the imminent “thaw” of U.S.-China relations in Hiroshima, and McCarthy’s prediction made seven days ago, will it also come true?","link":"/World/U.S._Debt_on_the_Verge_of_Default.html"},{"title":"Voting Methods in DAOs","text":"During the recent six months of practicing DAOs (Decentralized Autonomous Organizations), the basic form of organizational governance, namely voting, has been frequently pondered upon. Voting is a form of decision-making, a collective decision-making method in which multiple individual members make decisions on a particular issue. From nations to companies, decisions are required everywhere. Unless it’s a dictatorship where one person makes all the decisions, there is a need for a collective decision-making mechanism, which is where voting comes in. Sometimes, we may not have the explicit form of voting or there may be manipulated or false explicit forms, but we cannot eliminate the existence of implicit voting, also known as “voting with our feet.” When you, as a manager, convene your leadership team for a decision-making meeting but fail to reach a consensus and impose your decision, the subsequent execution is likely to deviate, and this is when “voting with our feet” comes into play. Countless companies have spent countless resources and invited numerous trainers in an attempt to train managers to adhere to a behavior guideline: express opinions during the meeting but retain them afterward. Regardless of the conclusions reached in the meeting, whether understood or not, one must firmly execute according to those conclusions. However, once you have managed for a few days, you will realize that this is contrary to human nature. It is impossible to achieve because it is contrary to human nature, and because it is impossible to achieve, trainers continue to have business. Raising a child. When you expect a child to “obey” and they don’t comply with your wishes, you understand that an adult is nothing more than a grown-up child. It is human nature to disobey decisions that contradict one’s own interests. Many times, the body can determine faster than the mind whether something is in one’s self-interest or contrary to it. To reach a decision that everyone truly accepts and forms a genuine consensus from the bottom of their hearts, and spontaneously acts and executes according to that consensus, is extremely challenging. Therefore, even if we use democratic methods to allow everyone to vote and make decisions collectively, it cannot solve this problem. Unfortunately, this is not possible, as Arrow’s impossibility theorem has proven that there is no absolute fair voting rule. In 1951, Arrow wrote “Social Choice and Individual Values” using a mathematical axiomatic approach to study voting, and his conclusion was that under a democratic system, it is impossible to achieve a result that satisfies everyone when there are multiple alternative options and diverse preferences among the social members. Arrow’s impossibility theorem states that it is impossible, based on a simple majority voting principle, to select a common unanimous order from various individual preferences. Therefore, a reasonable determination of public goods can only come from a competent public authority. It is generally impossible to achieve coordinated and consistent collective choice results through the voting process. For example, the voting paradox proposed by Condorcet as early as the 18th century: there are three options, a, b, c, and three voters, A, B, C. Each of them has a different ranking: A: a &gt; b &gt; c; B: b &gt; c &gt; a; C: c &gt; a &gt; b. In a vote between a and b, A and C favor a, while B favors b, and a wins. In a vote between b and c, A and B favor b, while C favors c, and b wins.In a vote between a and c, B and C favor c, while A favors a, and c wins.The ultimate social preference order cannot be determined in the end. Instead, the voting results are determined by how the voting procedure is arranged. At this point, whoever controls the agenda has the potential to influence the final outcome. Procedural justice does not necessarily lead to substantive justice. At the national level, voting is often based on the principle of one person, one vote. However, in corporate shareholder voting, it is based on the proportion of shares or agreed-upon multiple voting rights, granting different “voice” to stakeholders. The former is more like “majority rule,” while the latter is “money talks” or “influence based on interests.” What is the rationale behind this? The state is a tool of class rule, a machine for one class to rule and oppress another. Corporations, on the other hand, are tools for capital accumulation, mechanisms for investment and profit extraction. The economic foundation of the state is taxation (in ancient times, it was tributes). The economic foundation of companies is profit (i.e., surplus value). However, they both emerge based on the progress of productive forces and the generation of surplus. Once there is surplus production, capable of supporting some non-laboring individuals, they will evolve into ruling classes and then deprive the working class of resistance forces, including physical and ideological weapons, thus establishing lasting domination and giving rise to the state. When capital accumulates surplus and requires effective investment and return, it gives rise to those who facilitate capital growth: financiers, entrepreneurs, and their representatives, such as managers. Through accounting and legal safeguards, they construct a fictional entity for economic activity and profit creation – the corporation. The scope of democracy or voting eligibility is inevitably limited to a particular class or group. For the state, it is citizens (the ruling class). For corporations, it is shareholders. You are a citizen of a country simply because you were born there. When you arrive, you have nothing but yourself. When you die, you cannot take anything with you. Therefore, voting rights are calculated on a per capita basis, one person, one vote, and everyone is equal. Shareholders in corporations are different. Corporations embody capital. As a shareholder, the person is not important; what matters is the capital injected into the company. Hence, voting rights are calculated based on shareholdings. The more capital injected, the more shares held, the greater the voting and decision-making power. The “one person, one vote” approach has been discussed by Arrow. Majority rule can lead to the tyranny of the majority, depriving the minority of living space and weakening the overall flexibility and adaptability. When the external environment changes, national fortunes decline. The issue of capital determining voice can easily lead to an oligarchic dictatorship, significantly increasing the strategic risks of the entire organization. Relying on individuals’ enlightenment, without systemic correction mechanisms, a single misstep can result in a total loss. So, is DAO an investment tool? Based on some early industry practices, DAO is indeed closer to an investment tool. For example, the well-known ConstitutionDAO aimed to crowdfund the original US Constitution. When people invested money, they formed a DAO in form. But were these investors truly buying the original constitution, waiting for appreciation or future exhibition income, or simply “donating” to support an interesting endeavor? Or was the auction and the item being auctioned just a starting point, triggering speculation on DAO tokens? In fact, the auction was not successful, and after a voluntary refund, those who did not request a refund held onto the DAO token, PEOPLE, which became highly traded on the market. In a sense, PEOPLE had turned into a meme. In that case, do all those who purchase and hold SHIB (another previously hot meme token) have any expectation of appreciation? Will they still have it after the price drops and the market cools down? “Free is not really free. All gifts have a hidden price tag. Behind the fair launch, early schemers profit greatly from their early positioning. From the perspective of these schemers, harvesting the “leeks” (referring to inexperienced investors) is a form of “secondary market financing.” However, will this financing be used for value creation and production? Probably not. There are no mechanisms to constrain them from doing otherwise. In the end, they will only squander and consume the capital gained from harvesting, serving as the raw material for the next round of manipulation. If DAO evolves towards becoming an investment tool, moving in the direction of companies, it is highly likely to transform into a meme. And meme coins, fundamentally, are tools for consuming value rather than creating value. The phenomenon of memes proves that our human society may have entered an era of excessive capital. It requires rapid liquidation or zeroing out to eliminate the surplus capital held by all the “leeks.” Excessive capital is concentrated. The advent of AI further enhances productivity and capital efficiency, reducing the need for human labor. It’s a double-edged sword. On one hand, capitalists have too much money in their hands; on the other hand, capitalists are unwilling to pay wages and employ human labor, leading to massive layoffs, job losses, and unemployment. AI is driving us into an era of labor surplus. This surplus may not only be quantitative but also qualitative. Large technology companies lay off a significant number of highly educated employees who then have to seek reemployment in jobs such as truck driving or dishwashing. While the unemployment rate may not be high in statistical terms, labor is being wasted unintentionally. DAO should become a new species in the era of labor surplus, a new mode of production. It should gather surplus labor, create new value increments, and distribute them fairly and reasonably. DAO should be the “lost paradise” of free individuals in the post-AI era. DAO is the free association of free individuals. The economic basis of DAO remains surplus value. However, the distribution of surplus value is determined collectively by all those who contribute to it. What participants bring into DAO is merely productivity. Therefore, voting rights, decision-making power, and the right to speak are based on the contributed productivity. Capital can also enter, but capital must first purchase productivity in the market and contribute it to DAO. The decision-making form of DAO should not be based on the “one person, one vote” principle of national governance or the dominance of equity in corporate governance. It should consider both. For example, a dual-layer voting system can be adopted: in the first layer, the number of supporters among participants needs to exceed two-thirds; in the second layer, the sum of tokens held by supporters should exceed 40%. In this way, it can prevent large holders from unilaterally proposing actions that harm the majority, as well as prevent a group of retail investors from banding together to propose actions that harm large holders. Applying the voting paradox described above, although it does not solve the voting paradox and cannot derive deterministic results, it can avoid two situations: assuming token holdings follow a power-law distribution of 1:2:7, where A holds 10%, B holds 20%, and C holds 70%. A and B cannot unite to pass proposal B that is unfavorable to C, and C cannot independently pass proposal C that is most favorable to themselves. If A can strive to set the agenda for voting on proposals A and B, they will get the best result they want. If C can use their influence to set the agenda for voting on proposals A and C, they will get the most favorable result for themselves. Either A gets the best or worst outcome, B only gets a mediocre result, and C will always get an upper-moderate result. If B chooses to ally with A, it will allow A to get the best result while getting the worst result for themselves. If B chooses to ally with C, they will get a moderate result while C gets an upper-moderate result. If B and C ally, they will certainly set the agenda for voting on proposals A and C. As a result, they will inevitably obtain outcome C. This outcome is the worst for A, mediocre for B, and the best for C. If the distribution of 1:2:7 represents the distribution of wealth, then the deduction above can be translated as: the rich unite to oppress the middle class and the poor. If the distribution of 1:2:7 represents the contribution of labor, then it can be translated as: contributors ruling over non-contributors.","link":"/Crypto/Voting_Methods_in_DAOs.html"},{"title":"What is Web3 Privacy? How is its Current Development?","text":"Generally speaking, internet privacy primarily concerns the invisibility of users’ data information, such as their identities, behaviors, and activities. In the era of the internet, all our information and actions are presented in a digital form. However, once any system storing digital information is connected to the network, it becomes a potential target for hackers. This is especially critical when it comes to sensitive information related to finance and personal health. The privacy and security of data become even more important. Based on the development of the internet, it has gone through different privacy storage channels from Web 1.0 to the current Web 3.0: Web 1.0 was a static internet where the main applications were network media. Websites provided content, and users could only passively browse through text, images, and videos. They couldn’t actively participate in the creation process. Web 2.0 is the interactive internet, the stage we are currently in. The main applications include social networks, video platforms, e-commerce, etc. Users can independently create and upload content for interaction on these platforms. It can be observed that the data and privacy in the first two stages were stored and controlled by centralized institutions, similar to how traditional banking models protect necessary and valuable privacy information. In the present Web 3.0, the main features include public and transparent blockchain ledgers and decentralization. The blockchain is used to record on-chain data, which includes our transactions and the information contained within them. Specifically, this usually includes the sender, recipient, and amount of the transaction. If users do not want to disclose this on-chain data, it becomes the aspect of user privacy that needs protection in Web3. But how can user privacy be safeguarded? In the tenth chapter of the Bitcoin whitepaper, Satoshi Nakamoto dedicated the entire chapter to describing the privacy model of the Bitcoin blockchain network. The model goes from “banks to the Bitcoin network.” The Bitcoin blockchain solves this issue through asymmetric encryption. After users have control over their privacy information through blockchain privacy technologies, they can create and lead content and applications. This leads to user co-creation and decentralized governance (DAO, decentralized autonomous organization) while also allowing users to share the value of platforms/protocols. According to data, identity, and computation privacy, the Web3 privacy sector has developed numerous applications. If we break it down, it can be divided into four main categories: privacy tokens, privacy computation protocols, privacy transaction protocols, and privacy applications. Here are the specifics: Privacy Assets:Privacy assets refer to encrypted assets that natively support privacy. External parties cannot view specific transaction types, amounts, and other information about the parties involved. They usually do not support smart contracts or related applications. The earliest projects in this area emerged in 2011. The most well-known project is Zcash. It is the first blockchain system to utilize the Zk-SNARK zero-knowledge proof mechanism, aiming to completely address the issue of transaction tracing and user privacy exposure. Privacy Computation Protocols:Privacy computation protocols primarily protect privacy throughout the stages of data generation, collection, storage, analysis, utilization, and destruction. Apart from common use cases in DeFi and NFT scenarios, these protocols can also integrate deeply with the big data and AI industries as technology advances. However, the practical application scenarios of privacy computation protocols are currently relatively limited, and their development is somewhat average. Privacy Transaction Protocols:Privacy transaction protocols focus on the privacy-oriented processing of on-chain transaction data. Through technologies like zero-knowledge proofs, these protocols natively support users in conducting private transactions, ensuring that their privacy data is not visible to external parties. They also support the development of various types of privacy applications within the protocol. Privacy transaction networks include Layer1 privacy protocols and Layer2 privacy protocols, but there are not many mainnet deployments currently, and overall development is average. Privacy Applications:Privacy applications are built on Layer1 or Layer2 protocols and provide privacy protection functionalities for users or DApps in different application scenarios, such as transactions, payments, emails, etc. Currently, there are also many projects developing privacy applications, but few have gained significant traction. The decentralized nature of Web3 empowers individuals with greater autonomy and privacy protection, giving us more choices and control. However, currently, industry security is still highly valued, particularly in the development of various wallets. The privacy sector still appears to be a niche market, with relatively lower user and usage volumes compared to other sectors within the crypto community. Most privacy infrastructure and applications are still in the development and construction phase. Nevertheless, some people believe that privacy solutions have strong appeal in attracting more institutional capital to participate in the crypto ecosystem. Privacy ensures the protection of important financial data and trade secrets, making it an essential infrastructure for the next wave of crypto adoption. Whether encrypted privacy can attract more users in future use cases is still worth monitoring and observing.","link":"/Crypto/What-is-Web3-Privacy-How-is-its-Current-Development.html"},{"title":"What is value?","text":"Overnight, BTC continues to consolidate above 30k. It’s a garbage time for traders but a golden time for hodlers. The longer it consolidates, the more fear it instills in many people. The more afraid they become, the less inclined they are to accumulate more or even consider reducing their holdings for safety. There is a superstitious saying among technical analysis enthusiasts, “Consolidation leads to a drop.” Jiao Chain doesn’t understand this saying. Drop? In which direction will it drop? If that’s the case, wouldn’t a 1/BTC candlestick chart indicate a rise after prolonged consolidation? It shows that technical analysis, if not entirely useless, is at least largely ineffective. Some may scoff and ask: If technical analysis is useless, does that mean we should focus on value investing? Well, let’s hear your opinion. What value does BTC have? To answer the question of “What value does BTC have?”, we must first ask a more fundamental question: What is value? Essentially, the answers to this question constitute the entire field of economics. Different answers and the supporting theories form different economic schools of thought. However, we won’t delve into the profound and abstract economic theories here. Jiao Chain simply wants to share some brief thoughts and understanding on this question. Firstly, in the most basic language, when we say that something has value to someone, we mean that it is beneficial to their interests. For example, bread has value to Zhang San because eating it can alleviate hunger, or Zhang San can sell the bread and make money. Similarly, Xiao Li has value to Lao Wang because Xiao Li can take care of Lao Wang’s daily needs, or Xiao Li can work for Lao Wang and help him sell products to earn money. The ability to be eaten and taken care of, such as bread and Xiao Li’s services, constitutes non-economic value. The ability to be sold or exchanged, such as bread being sold for money or Xiao Li earning money, constitutes economic value. Some economic schools refer to non-economic value as “use value” or “practical value,” and economic value as “exchange value.” However, can’t we consider the value of Lao Wang employing Xiao Li as a form of use value? Therefore, the value derived from Lao Wang’s employment of Xiao Li can also be called use value. It’s evident that the ambiguity of language often confuses people. No wonder Ludwig Wittgenstein said that language is the limit of human reason. Some economic schools focus on non-economic value and discover the principle of diminishing marginal utility. However, this principle doesn’t hold true for economic value. Eating bread can satisfy hunger, and non-economic value diminishes or disappears as it is satisfied. However, no one would complain about having too much money. People’s pursuit of economic value is insatiable, and there is no diminishing marginal utility in this context. Deep down, humans tend to prioritize economic value over non-economic value, even though, ironically, all economic value must ultimately be tied to some form of non-economic value, or else it devolves into financial speculation. In a family, the person who works full-time at home often receives less recognition, while the one who goes out to work and earns money often has a higher status. In a company, those involved in product technology often have less say, while the top-performing salesperson who directly generates revenue can influence major decisions. In a country, the hardworking lower-class people have little social status, while the idle capitalist players suffering from depression are listed on the rich list and admired by the world. Secondly, economic value is highly regarded because we need to benefit others. What does it mean to benefit others? It means enabling someone to gain value. Why do we benefit others? The fundamental reason is that we have needs that can only be fulfilled by others. I have five pieces of bread. After eating three pieces, I am no longer hungry. The remaining two pieces have no non-economic value to me. Overall, the value of three pieces of bread is reduced to zero. But if I give the remaining two pieces of bread to Xiao Wang, he eats them and is no longer hungry. The two pieces of bread regain their non-economic value in Xiao Wang’s hands. The entire “society” realizes the value of all five pieces of bread (non-economic value) collectively. Let’s denote non-economic value as vn and economic value as ve. In the case of me eating the bread, it contributes overall: vn(three pieces of bread) = vn(3). In the case of Xiao Wang and me eating the bread together, it contributes overall: vn(three pieces of bread) + vn(two pieces of bread) = vn(3) + vn(2) = vn(5). Sharing maximizes the non-economic value of the bread. However, this kind of gratuitous sharing is limited to a network of acquaintances or even family. In primitive tribal societies, it could extend to a tribe or a few neighboring tribes at most. If we want to share on a larger scale, it becomes impossible because we cannot guarantee that others will not become selfish individuals who only take without giving. Thus, if Xiao Wang and I are not related, I would have to exchange the two pieces of bread for something he has that I need. The common medium of exchange we use today is currency. Once economic exchange occurs, the bread gains an additional layer of economic value, ve. Overall, it contributes: vn(three pieces of bread) + ve(two pieces of bread) + vn(two pieces of bread) = vn(3) + ve(2) + vn(2) = v(7). Can we simply add vn(3) and ve(2) together? Mathematically, we cannot directly add values with different dimensions. However, psychologically, we can add them together. I feel that I have gained the total value of five pieces of bread (although I have confused non-economic value with economic value, as mentioned earlier). The creation of ve(2) value through economic exchange represents the indebtedness of society to the recipient of the currency. This value is only realized when, at some future time, you can exchange the currency equivalent to ve(2) for something you desire. This is the logic behind the dominant debt-based monetary system in today’s world. The US dollar is the largest and most widely used debt-based currency globally. What if we didn’t use debt-based currency? Instead, we used dried fish as a medium of exchange equivalent to ve(2). In this case, I would exchange for a tangible value: the actual N dried fish I receive represents a combination of the non-economic value I derive from eating them and the economic value of being able to trade them for the goods I need from others. Bitcoin is that dried fish—never decaying, easily divisible, easily identifiable, and can be sent via the Internet—a better form of dried fish. Regardless, our willingness to engage in exchange and maximize value is not due to our kindness or pure altruism, but because we are interdependent and need each other to fulfill our needs. Thirdly, merely needing each other is not enough; there must also be clear and inalienable ownership rights. Ownership and property rights are closely related to sovereignty. Humans have a need for pigs (to eat pork), but they don’t engage in economic exchange with pigs. In the novel “Journey to the West,” monsters have a need to eat humans, but they also don’t engage in economic exchange with humans most of the time. When you lose ownership rights over yourself, you lose sovereignty; when you lose ownership rights over your property, you lose property rights. When you lose sovereignty and property rights, you also lose the value of exchanging with others. We are not just talking about personal ownership, such as the advocacy of “personal sovereignty.” Individual power is too weak when faced with organized groups or powerful Leviathans, making it unable to defend itself. Therefore, modern individuals must rely on the protection of the state to safeguard their ownership rights and engage in fair trade on that foundation. From the moment the first human picked up a tree branch or a stone from the ground and used it as a weapon, they established ownership over that branch or stone through their labor. This acquisition of ownership is natural. Because another person cannot violently seize the branch or stone from his hand, they must offer something else they own in exchange. Ownership rights emerge from this exchange. Bitcoin ensures that your private keys are your coins through cryptography and powerful computational power. No matter how powerful an individual or organization may be, they cannot seize your coins from you. Only in this way can your ownership of Bitcoin be a truly secure right. When ownership is lost, economic exchange ceases to exist.","link":"/Crypto/What_is_value.html"},{"title":"What kind of mistakes should never be made in the cryptocurrency market?","text":"If you followed the investment advice of the BlackRock CEO and went long on Bitcoin yesterday, you would have probably learned your lesson from the market today. Today, let’s take a look at how Levermore, more than a hundred years ago, fell victim to trusting the views of the big shots and ended up losing money. We all know that in most fields, to excel at something, you need guidance from experts and masters, often needing to follow their instructions completely. You seek a doctor when you’re sick, a lawyer when you’re dealing with legal matters, and a mechanic when your car breaks down. But in the investment industry, this rule doesn’t apply. Investing is not like seeking medical treatment, fighting a legal battle, or fixing a car; authority and experience don’t necessarily equate to being correct. Even today’s stock market legends like Warren Buffett and Charlie Munger cannot predict the past and future of Bitcoin. Buffett expressed doubts about Bitcoin as early as 2014 in an interview, stating, “Personally, I would stay away from it. I would never have anything to do with it. I would not encourage it. I would not believe it. It’s a mirage basically.” If you were an early Bitcoin investor in 2014 and followed the advice of the world’s most successful investor, you would have probably left the cryptocurrency market long ago, missing out on many opportunities to make money. In 2018, Buffett reiterated his negative views on Bitcoin at the Berkshire Hathaway annual shareholders meeting, calling it “rat poison” and stating that it has no intrinsic value. Another partner of his, Charlie Munger, vehemently criticized cryptocurrencies, referring to investors as “idiots” and calling investing in Bitcoin extremely foolish. I have witnessed many similar real-life examples around me. For instance, someone in 2017 intended to buy Bitcoin after listening to my audio, but then they heard a famous economist, Lang Xianping, saying Bitcoin was worthless and a typical Ponzi scheme, just like the Tulip Mania. So, they unquestioningly believed this economist’s words and missed out on the significant bull market of 2017. There are many similar examples. Even if you are the CEO of a listed company or the founder of a particular cryptocurrency, holding all the information about your company, or even a Nobel laureate in economics who understands the principles of economic operations, you may not necessarily make money in the investment market. That’s because the market has its own logic, and if you think you can make money simply by relying on bull markets and advice from big shots, or by relying on so-called insider information, you are simply daydreaming. Levermore suffered bankruptcy because of relying too much on the views of authority figures. In 1907, Levermore made a fortune by shorting cotton futures, earning him the title of the new “Cotton King.” At that time, the well-established “Cotton King” Thomas invited him to meet and proposed collaboration. Thomas, who had been in the cotton market for many years, was famous among cotton traders worldwide, much like Vitalik Buterin in the cryptocurrency world today. Even though Levermore was already quite capable, he approached Thomas like a fan meeting an idol. However, their views on the future trend of cotton futures were opposite. In Levermore’s eyes, Thomas was intelligent and sincere, treating him like a friend. So, he decided to change his trading strategy, thinking that Thomas must know better. As a result, he lost all the millions of dollars he had previously made, adding another chapter of personal bankruptcy. This shows that while experts and authorities can provide advice, they won’t take responsibility for your wallet. If you blindly trust authority figures, you will lose your own judgment. Even if you make money, you won’t know how you made it, and you might end up losing even more. Now that we understand that we shouldn’t listen to authorities, let’s discuss whether we can rely on insider information. People often say that the capital market is a battlefield of information, where information represents opportunities and money. For example, if a small token has significant positive news, its price will rise. If you can access that information before it’s publicly announced, you can buy in advance and wait to make money, right? The reality is quite different. Let’s not even consider that using insider information for profit is illegal in today’s compliant financial markets, which can result in fines and imprisonment. Even in times when insider trading was not illegal, Levermore refused to listen to any hearsay or inside rumors. Even if a friend told him the news sincerely, even if the friend put all his assets on the line, there was no guarantee that the information was reliable. Why is that? Firstly, the insider information you receive is likely to be false. If a stock has good news, why would someone spreading the news not keep it to themselves and make a significant profit? There are often internal interest groups in the market that spread malicious false information, aiming to sell stocks at inflated prices to small and medium-sized investors. Some people still believe it and bet their fortune. Secondly, even if the information is true, it’s difficult to profit from it when you receive it. For example, when a company’s business performance improves, and its revenue increases, insiders will know this earlier. However, will they immediately release the good news? Insiders will withhold positive news, waiting to buy enough shares before announcing it, so they can profit from it. Thirdly, insiders will only tell you when to buy, but they won’t tell you when to sell. Whether it’s true or false news, whether you find out early or late, you still rely on others without having your own method of making money. Even if you make money in the short term, you will lose it in the long run. Levermore himself did not listen to insider information, but his wife fell victim to it. The president of a company, pretending to be mysterious, told Levermore’s wife that their company had significant positive news, and the stock would definitely rise. He claimed to only share this information with her because he respected her. He expected Levermore’s wife to tell her husband. With the financial resources and influence of the “Stock Market Guru,” the stock price would rise even higher, and he could benefit from it. However, his plan went wrong. Levermore’s wife had just made a small fortune and wanted to make some extra money without her husband knowing. Unfortunately, within a few days, she lost all the money, and that’s when she had to tell her husband. Levermore couldn’t help but cry and laugh because it was the same stock he had shorted, and he had already predicted a major decline. It seems that this is the difference between the stock market guru’s wife and the stock market guru himself. One listens to authority and insider information, while the other only trusts their own judgment. So, today, the two market trading rules we discussed are lessons and teachings that Levermore summarized more than a hundred years ago. If we can understand this principle earlier, we can at least avoid some detours. Alright, let’s continue our discussion tomorrow to uncover the fatal mistakes that led to Levermore’s final failure and his inability to turn things around.","link":"/Crypto/What_kind_of_mistakes_should_never_be_made_in_the_cryptocurrency_market.html"}],"tags":[{"name":"Apple","slug":"Apple","link":"/tags/Apple/"},{"name":"AI","slug":"AI","link":"/tags/AI/"},{"name":"BTC","slug":"BTC","link":"/tags/BTC/"},{"name":"Blockchain","slug":"Blockchain","link":"/tags/Blockchain/"},{"name":"web3","slug":"web3","link":"/tags/web3/"},{"name":"HK","slug":"HK","link":"/tags/HK/"},{"name":"Shell","slug":"Shell","link":"/tags/Shell/"},{"name":"BTC，Tesla","slug":"BTC，Tesla","link":"/tags/BTC%EF%BC%8CTesla/"},{"name":"UBI","slug":"UBI","link":"/tags/UBI/"},{"name":"Tencent","slug":"Tencent","link":"/tags/Tencent/"},{"name":"Covid-19","slug":"Covid-19","link":"/tags/Covid-19/"},{"name":"Movie","slug":"Movie","link":"/tags/Movie/"},{"name":"Hollywood","slug":"Hollywood","link":"/tags/Hollywood/"},{"name":"ChatGPT","slug":"ChatGPT","link":"/tags/ChatGPT/"},{"name":"Musk","slug":"Musk","link":"/tags/Musk/"},{"name":"Tesla","slug":"Tesla","link":"/tags/Tesla/"},{"name":"Voting","slug":"Voting","link":"/tags/Voting/"},{"name":"ETH","slug":"ETH","link":"/tags/ETH/"},{"name":"Paradigm","slug":"Paradigm","link":"/tags/Paradigm/"},{"name":"Mail","slug":"Mail","link":"/tags/Mail/"},{"name":"Stablecoin","slug":"Stablecoin","link":"/tags/Stablecoin/"},{"name":"Web3","slug":"Web3","link":"/tags/Web3/"},{"name":"Fed","slug":"Fed","link":"/tags/Fed/"},{"name":"Dragon","slug":"Dragon","link":"/tags/Dragon/"},{"name":"stamp","slug":"stamp","link":"/tags/stamp/"},{"name":"Uniswap","slug":"Uniswap","link":"/tags/Uniswap/"},{"name":"Wolf","slug":"Wolf","link":"/tags/Wolf/"},{"name":"Internet","slug":"Internet","link":"/tags/Internet/"},{"name":"USA","slug":"USA","link":"/tags/USA/"},{"name":"Investment","slug":"Investment","link":"/tags/Investment/"}],"categories":[{"name":"Tech","slug":"Tech","link":"/categories/Tech/"},{"name":"Crypto","slug":"Crypto","link":"/categories/Crypto/"},{"name":"World","slug":"World","link":"/categories/World/"}]}